[
   {
      "title": "Thirteen passenger boats destroyed in Vreed-en-Hoop fire",
      "description": "The Guyana Fire Service received a call at 1:49 a.m. today and was informed of a fire at the Vreed-en-Hoop Stelling, West Coast Demerara. The article Thirteen passenger boats destroyed in Vreed-en-Hoop fire appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/guyana/thirteen-passenger-boast-destroyed-in-vreed-en-hoop-fire/",
      "image": null,
      "published": 1690908069,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Trinidad: Mom of Carenage murder victim forgives her killers",
      "description": "(Trinidad Guardian) The mother of a 28-year-old woman who was gunned down in Carenage says she is willing to forgive her daughter’s killers as she is doing her part to break the cycle of hate in the country. The article Trinidad: Mom of Carenage murder victim forgives her killers appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/regional/trinidad/trinidad-mom-of-carenage-murder-victim-forgives-her-killers/",
      "image": null,
      "published": 1690894193,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Trinidad: Intruder killed by woman was security guard",
      "description": "(Trinidad Express) The man killed on Saturday night when he and his accomplices attempted to invade a house at Endeavour, Chaguanas, was identified yesterday as Mark Anthony Joseph, 25. The article Trinidad: Intruder killed by woman was security guard appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/regional/trinidad/trinidad-intruder-killed-by-woman-was-security-guard/",
      "image": null,
      "published": 1690893918,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "GRA losing skilled staff to oil companies - -Statia tells PAC",
      "description": "Guyana Revenue Authority (GRA) Commissioner-General, Godfrey Statia, told the Public Accounts Committee (PAC) meeting yesterday that it is losing trained and skilled personnel as oil companies are enticing them away with far higher salaries. The article GRA losing skilled staff to oil companies appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/guyana/gra-losing-skilled-staff-to-oil-companies/",
      "image": null,
      "published": 1690870301,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Woman remanded over Linden bus park killing",
      "description": "Vanessa Emmanuel, 25, of Lot 992 Section B, Block “X” Greater Diamond, East Bank Demerara, appeared at the George-town Magistrate’s Court yesterday before Acting Chief Magistrate Sherdel Isaacs- Marcus to answer to the charge of man-slaughter. The article Woman remanded over Linden bus park killing appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/guyana/woman-remanded-over-linden-bus-park-killing/",
      "image": null,
      "published": 1690870230,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Pooran returns after MLC assignment; Hetmyer, Hope recalled",
      "description": "PORT OF SPAIN, Trinidad,  CMC – Left-hander Nicholas Pooran has returned for the Twenty20 International series against India starting here Thursday, after being named in a 15-man provisional squad announced by Cricket West Indies yesterday. The article Pooran returns after MLC assignment; Hetmyer, Hope recalled appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/sports/pooran-returns-after-mlc-assignment-hetmyer-hope-recalled/",
      "image": null,
      "published": 1690870220,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Trio freed over murder of man in 2012 - -court says prosecution failed to establish identity of victim",
      "description": "With the prosecution failing to establish the identity of the person it said they murdered, Ray Yokum, Steffon Campbell and Faisal Moore were yesterday discharged of the crime and set free. The article Trio freed over murder of man in 2012 appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/guyana/trio-freed-over-murder-of-man-in-2012/",
      "image": null,
      "published": 1690870196,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Charity charges into round of 16 with 8-0 drubbing of Marian Academy - Digicel Schools Football Championship",
      "description": "Charlestown, Charity, Mahaicony Technical Institute (MTI), and Westminster stormed into the round of 16 section following victories yesterday in the Digicel Schools Football Championship. The article Charity charges into round of 16 with 8-0 drubbing of Marian Academy appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/sports/charity-charges-into-round-of-16-with-8-0-drubbing-of-marian-academy/",
      "image": null,
      "published": 1690870165,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Archibald bags three gold medals at Trinidad’s National Championships",
      "description": "Some local track stars took their talents to Trinidad and Tobago during the weekend and recorded several victories at the Hasely Crawford stadium where the island’s National Track and Field Championships was staged. The article Archibald bags three gold medals at Trinidad’s National Championships appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/sports/archibald-bags-three-gold-medals-at-trinidads-national-championships/",
      "image": null,
      "published": 1690870132,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Ram & McRae turns sod for $400m office",
      "description": "Ram & McRae, Chartered Accountants, Professional Services Firm hosted a sod-turning exercise yesterday for the company’s new three-storey office building, the cost of which is estimated to be $400m. The article Ram & McRae turns sod for $400m office appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/guyana/ram-mcrae-turns-sod-for-400m-office/",
      "image": null,
      "published": 1690870106,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Lands and Surveys employees in training on mapping techniques",
      "description": "Twenty-five employees of the Guyana Lands and Surveys Commission (GLSC) recently underwent training on land mapping techniques and administration. The article Lands and Surveys employees in training on mapping techniques appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/guyana/lands-and-surveys-employees-in-training-on-mapping-techniques/",
      "image": null,
      "published": 1690870079,
      "code": "gy",
      "category": "technology"
   },
   {
      "title": "WI embrace hopes of long-awaited series win",
      "description": "TAROUBA, Trinidad,  CMC – West Indies’ convincing six-wicket victory over India in last Saturday’s second One-Day International has raised their hopes of ending their near two decade-long wait for an ODI series win against the Asian giants. The article WI embrace hopes of long-awaited series win appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/sports/wi-embrace-hopes-of-long-awaited-series-win/",
      "image": null,
      "published": 1690870078,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Gov’t should use authority of mining law and Article 36 of  Constitution to immediately remove the illegal Chinese Landing miners",
      "description": "Dear Editor, Your editorial ‘IACHR resolution’ on 30 July 2023 summarises the resolution about the dreadful long-running case of illegal mining at Chinese Landing. The The article Gov’t should use authority of mining law and Article 36 of  Constitution to immediately remove the illegal Chinese Landing miners appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/opinion/letters/govt-should-use-authority-of-mining-law-and-article-36-of-constitution-to-immediately-remove-the-illegal-chinese-landing-miners/",
      "image": null,
      "published": 1690870077,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Broad scripts perfect farewell as England level Ashes series",
      "description": "LONDON,  (Reuters) – England’s Stuart Broad claimed the last two Australia wickets to secure a dramatic 49-run victory for his team in the final Ashes test at The Oval yesterday and leave the series locked at 2-2 after five gripping matches. The article Broad scripts perfect farewell as England level Ashes series appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/sports/broad-scripts-perfect-farewell-as-england-level-ashes-series/",
      "image": null,
      "published": 1690870013,
      "code": "gy",
      "category": "entertainment"
   },
   {
      "title": "True Emancipation comes with economic independence",
      "description": "Dear Editor, This is perhaps the most important Emancipation Day commemoration in Guyana. The article True Emancipation comes with economic independence appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/opinion/letters/true-emancipation-comes-with-economic-independence/",
      "image": null,
      "published": 1690870012,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Mangrove odyssey underlines conservation message",
      "description": "A trip to a stretch of mangroves on the East Coast of Demerara was organised on Sunday to underline the need for their conservation. The article Mangrove odyssey underlines conservation message appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/guyana/mangrove-odyssey-underlines-conservation-message/",
      "image": null,
      "published": 1690869970,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Delinquent T&T company to provide proposal on Conversation Tree-Dennis St project",
      "description": "Trinidad Company, Kallco Guyana Inc. is expected to produce a proposal to the Ministry of Public Work on how it plans to finish the second leg of the Conversation Tree to Dennis Street road project in Georgetown. The article Delinquent T&T company to provide proposal on Conversation Tree-Dennis St project appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/guyana/delinquent-tt-company-to-provide-proposal-on-conversation-tree-dennis-st-project/",
      "image": null,
      "published": 1690869951,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Every reason listed by GHK Lall for not engaging against gold smuggling is faced by CANU",
      "description": "Dear Editor, GHK Lall details a litany of reasons he did not engage with the scourge of gold smuggling, a stunning tale of woe and defeat before the task even began; a sad, self-indulgent wallow in the muddy glory hole of those who quit for fear of defeat. The article Every reason listed by GHK Lall for not engaging against gold smuggling is faced by CANU appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/opinion/letters/every-reason-listed-by-ghk-lall-for-not-engaging-against-gold-smuggling-is-faced-by-canu/",
      "image": null,
      "published": 1690869951,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "James fiver puts Jamaica in control of final",
      "description": "KINGSTOWN, St Vincent,  CMC – A five-wicket haul from fast bowler Deshawn James handed Jamaica control of the Rising Stars Under-19 men’s three-day final against Barbados, on day two of the contest here yesterday. The article James fiver puts Jamaica in control of final appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/sports/james-fiver-puts-jamaica-in-control-of-final/",
      "image": null,
      "published": 1690869928,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Overseas-based nurse, businessman robbed in Berbice attacks",
      "description": "Last week an overseas-based Guyanese nurse who is visiting her residence in Edinburgh, East Bank Berbice and a Corentyne businessman were robbed of a large amount of cash in separate attacks at their respective homes. The article Overseas-based nurse, businessman robbed in Berbice attacks appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/guyana/overseas-based-nurse-businessman-robbed-in-berbice-attacks/",
      "image": null,
      "published": 1690869898,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Why after 200 years many African Guyanese still live in economically depressed conditions",
      "description": "Dear Editor, August 2023 marks another month, another year passed since the official emancipation of Africans from slavery in 1838. The article Why after 200 years many African Guyanese still live in economically depressed conditions appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/opinion/letters/why-after-200-years-many-african-guyanese-still-live-in-economically-depressed-conditions/",
      "image": null,
      "published": 1690869883,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Winning streak ‘keeps the fire going’, says Verstappen",
      "description": "(Reuters) – Max Verstappen is one race away from a record-equalling ninth win in a row and the Red Bull Formula One driver is finding dominance also brings more motivation for the future. The article Winning streak ‘keeps the fire going’, says Verstappen appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/sports/winning-streak-keeps-the-fire-going-says-verstappen/",
      "image": null,
      "published": 1690869883,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Former mayor among 10 for Know India Programme",
      "description": "Former Mayor of Georgetown, Ubraj Narine is among 10 Guyanese selected for the twenty-five  day-long 66th Know India Programme organized by the Ministry of External Affairs of the Government of India. The article Former mayor among 10 for Know India Programme appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/guyana/former-mayor-among-10-for-know-india-programme/",
      "image": null,
      "published": 1690869836,
      "code": "gy",
      "category": "science"
   },
   {
      "title": "UN urges states in Haiti’s region to join Kenya in security force",
      "description": "UNITED NATIONS,  (Reuters) – U.N. Secretary-General Antonio Guterres yesterday welcomed Kenya’s readiness to lead an international force to help Haiti’s police combat gang violence and encouraged other countries – particularly from Haiti’s region – to join the effort. The article UN urges states in Haiti’s region to join Kenya in security force appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/regional/un-urges-states-in-haitis-region-to-join-kenya-in-security-force-2/",
      "image": null,
      "published": 1690869815,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Human Beings",
      "description": "Dear Editor, Published just over a decade ago was the very educative text of Frederick Laloux resulting from a wide range of research of international companies each of whom managed some thousands of employees. The article Human Beings appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/opinion/letters/human-beings/",
      "image": null,
      "published": 1690869812,
      "code": "gy",
      "category": "science"
   },
   {
      "title": "Raso fires Australia into World Cup knockouts as Canada blitzed 4-0",
      "description": "MELBOURNE, (Reuters) – Hayley Raso scored a first half brace and Mary Fowler struck after the break as Australia crushed Canada 4-0 on Monday to storm into the last 16 of the Women’s World Cup and send the Olympic champions spinning out of the tournament. The article Raso fires Australia into World Cup knockouts as Canada blitzed 4-0 appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/sports/raso-fires-australia-into-world-cup-knockouts-as-canada-blitzed-4-0/",
      "image": null,
      "published": 1690869789,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Clashes between gangs, military kill at least 20 in Colombia",
      "description": "BOGOTA,  (Reuters) – At least 20 people were killed as Colombian military personnel clashed with FARC dissidents and the Clan del Golfo crime gang in different parts of the country, authorities said yesterday. The article Clashes between gangs, military kill at least 20 in Colombia appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/regional/clashes-between-gangs-military-kill-at-least-20-in-colombia/",
      "image": null,
      "published": 1690869776,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Taxi driver gets 56 months for robbing women at Providence",
      "description": "Quincy Barker, a 27-year-old taxi driver of Timehri who was arrested on the 21st July, 2023 in Region One for robbing two women at Providence has been sentenced to 56 months imprisonment. The article Taxi driver gets 56 months for robbing women at Providence appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/guyana/taxi-driver-gets-56-months-for-robbing-women-at-providence/",
      "image": null,
      "published": 1690869760,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Mr. Ghansham won in the court of public opinion",
      "description": "Dear Editor, Somebody does not know their place and it was not the passenger, he had an assigned seat number. The article Mr. Ghansham won in the court of public opinion appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/opinion/letters/mr-ghansham-won-in-the-court-of-public-opinion/",
      "image": null,
      "published": 1690869752,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Fans entertained at Drag Wars",
      "description": "The Tropical Shipping Drag Wars 2.0 was staged on Sunday at the South Dakota Circuit. The article Fans entertained at Drag Wars appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/sports/fans-entertained-at-drag-wars/",
      "image": null,
      "published": 1690869725,
      "code": "gy",
      "category": "entertainment"
   },
   {
      "title": "Man gets four years for Kitty drug trafficking",
      "description": "Caldwell Jackson (address not stated) who in 2022 was nabbed with narcotics by the Customs Anti-Narcotic Unit (CANU) was yesterday found guilty of the offence of drug trafficking and was sentenced to a four-year term of imprisonment. The article Man gets four years for Kitty drug trafficking appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/guyana/man-gets-four-years-for-kitty-drug-trafficking/",
      "image": null,
      "published": 1690869717,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "State investment in women-led small businesses is the way to go",
      "description": "One doesn’t have to look too hard to discover that there are significant (and growing) numbers of young Guyanese women – some of them still in their teens – who, these days, are drawn to one entrepreneurial pursuit or another. The article State investment in women-led small businesses is the way to go appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/opinion/editorial/state-investment-in-women-led-small-businesses-is-the-way-to-go/",
      "image": null,
      "published": 1690869713,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Politikles",
      "description": "The article Politikles appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/opinion/politikles/politikles-3323/",
      "image": null,
      "published": 1690869707,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Extolling the virtues of the PPP administration",
      "description": "Dear Editor, As we end the month of July, the Editorial in the State controlled newspaper and other similar outfits keep extolling the virtues of the PPP administration with language intended to fool the people. The article Extolling the virtues of the PPP administration appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/opinion/letters/extolling-the-virtues-of-the-ppp-administration/",
      "image": null,
      "published": 1690869704,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Bumrah back from injury to lead India in T20 series against Ireland",
      "description": "(Reuters) – India pace spearhead Jasprit Bumrah will return from a lengthy injury absence to lead the side against Ireland in the Twenty20 series next month, the Board of Control for Cricket in India (BCCI) said yesterday. The article Bumrah back from injury to lead India in T20 series against Ireland appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/sports/bumrah-back-from-injury-to-lead-india-in-t20-series-against-ireland/",
      "image": null,
      "published": 1690869692,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "Unlike China, India cannot be an economic superpower",
      "description": "By Ashoka Mody PRINCETON – In March 1985, the Wall Street Journal showered India’s new prime minister, Rajiv Gandhi, with its highest praise. The article Unlike China, India cannot be an economic superpower appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/features/project-syndicate/unlike-china-india-cannot-be-an-economic-superpower/",
      "image": null,
      "published": 1690869689,
      "code": "gy",
      "category": "technology"
   },
   {
      "title": "Happy emancipation!",
      "description": "The article Happy emancipation! appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/photos/happy-emancipation-3/",
      "image": null,
      "published": 1690869680,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Ecuadorean votes could bar oil output in Amazon reserve, mining near Quito",
      "description": "QUITO,  (Reuters) – Ecuadoreans will decide in two August referendums whether oil and mining projects in key regions of the country can continue, weighing Indigenous and environmental concerns against billions in potential lost income. The article Ecuadorean votes could bar oil output in Amazon reserve, mining near Quito appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/01/news/regional/ecuadorean-votes-could-bar-oil-output-in-amazon-reserve-mining-near-quito/",
      "image": null,
      "published": 1690869663,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "185th Emancipation Anniversary: Govt remains committed to continued Afro-Guyanese development – Pres Ali",
      "description": "…urges citizens to continue rejecting attempts to divide Assuring that the People’s Progressive Party/Civic (PPP/C) Government remains committed to reparations and continued development of Afro-Guyanese, President Dr Irfaan Ali in his Emancipation Day message lauded the contributions of African-Guyanese and urged persons to reject all who seek to stoke divisions. In his Emancipation Day message, […] The post 185th Emancipation Anniversary: Govt remains committed to continued Afro-Guyanese development – Pres Ali appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/185th-emancipation-anniversary-govt-remains-committed-to-continued-afro-guyanese-development-pres-ali/",
      "image": null,
      "published": 1690884341,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Vehicle smuggling via Lethem crossing an ongoing challenge – GRA Head",
      "description": "Notwithstanding the progress that has been made in tackling smuggling over the years, vehicle smuggling remains a challenge the Guyana Revenue Authority (GRA) is doing its utmost to confront. On Tuesday, GRA Commissioner General Godfrey Statia was asked about illegal vehicles in Guyana when he appeared before the Public Accounts Committee (PAC). The Auditor General […] The post Vehicle smuggling via Lethem crossing an ongoing challenge – GRA Head appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/vehicle-smuggling-via-lethem-crossing-an-ongoing-challenge-gra-head/",
      "image": null,
      "published": 1690884254,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "GRA pushing to set up cost recovery unit, struggles to retain staff",
      "description": "…appeals for loyalty, patriotism in face of oil companies’ allure The Guyana Revenue Authority (GRA) is building its capacity to monitor the oil and gas sector and while international help with training has been forthcoming from agencies like the International Monetary Fund (IMF), the tax agency continues to grapple with its staff being lured away […] The post GRA pushing to set up cost recovery unit, struggles to retain staff appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/gra-pushing-to-set-up-cost-recovery-unit-struggles-to-retain-staff/",
      "image": null,
      "published": 1690884237,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Identify, assist human trafficking victims – Magistrate urges public",
      "description": "The Second Vice President of the Guyana Association of Women Lawyers (GAWL), Magistrate Christel Lambert lamented the urgency in raising awareness of Trafficking in Persons (TIP), even as she called on the general populace to report suspicious situations to the national hotline. In observance of World Day against Trafficking in Persons, which is held annually […] The post Identify, assist human trafficking victims – Magistrate urges public appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/identify-assist-human-trafficking-victims-magistrate-urges-public/",
      "image": null,
      "published": 1690884139,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Outgoing Indian High Commissioner reaffirms commitment to new partnerships",
      "description": "As his stint as Indian High Commissioner to Guyana comes to an end, Dr KJ Srinivasa on Monday paid a courtesy call to Prime Minister, Brigadier (Ret’d) Mark Phillips and other Cabinet officials. Highlighting the importance of the Guyana-Indian cooperation, Dr Srinivasa said Guyana remains a crucial partner, indicating his Government’s commitment to cultivating and […] The post Outgoing Indian High Commissioner reaffirms commitment to new partnerships appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/outgoing-indian-high-commissioner-reaffirms-commitment-to-new-partnerships/",
      "image": null,
      "published": 1690884114,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Panamanian vessel which slammed into DHB sold",
      "description": "…company yet to pay compensation Panamanian vessel MT Tradewind Passion, the ship that crashed into the Demerara Harbour Bridge last October causing major damages, has been sold and it is uncertain what further action Government will take to extract compensation. General Manager of the Demerara Harbour Bridge, Wayne Watson told this publication that since the […] The post Panamanian vessel which slammed into DHB sold appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/panamanian-vessel-which-slammed-into-dhb-sold/",
      "image": null,
      "published": 1690884051,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Several safeguards in place for use of NRF funds – Jagdeo",
      "description": "…in spite of Opposition’s unwillingness to be on committees While the A Partnership for National Unity/Alliance For Change (APNU/AFC) has not meaningfully contributed to either the Petroleum Activities Bill, or fulfilled their oversight role of the Natural Resource Fund, Vice President Bharrat Jagdeo has assured that there are safeguards in place for using the revenues […] The post Several safeguards in place for use of NRF funds – Jagdeo appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/several-safeguards-in-place-for-use-of-nrf-funds-jagdeo/",
      "image": null,
      "published": 1690884022,
      "code": "gy",
      "category": "finance"
   },
   {
      "title": "Differences…  more the merrier",
      "description": "Imagine if all we creatures in the world were the same, how dull life would be!! Heck…we wouldn’t even be able to tell the differences between us. the hyenas and tigers! We’d be like some massive, humongous undifferentiated ocean of living things!! Excepting we’d be losing body parts regularly to creatures that may look just […] The post Differences…  more the merrier appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/differences-more-the-merrier/",
      "image": null,
      "published": 1690883700,
      "code": "gy",
      "category": "science"
   },
   {
      "title": "Emancipation Day",
      "description": "Today is a historic day for all Guyanese but more so for Guyanese of African descent. It was on this day, 185 years ago that their enslaved forbears could finally cry – as Martin Luther King would do in 1963 – “Free at last; free at last. Thank God Almighty, we are free at last!” […] The post Emancipation Day appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/emancipation-day-3/",
      "image": null,
      "published": 1690883419,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "African Guyanese contributions are evident in critical sectors – ERC",
      "description": "The Ethnic Relations Commission, (ERC), joins with all Guyanese in commemorating the185th Emancipation Anniversary and in particular, to acknowledge the struggles and victory of African Guyanese against the institution of slavery. According to the Venn Commission of the late 1940s, slavery in British Guiana resulted in close to half a million deaths of enslaved Africans […] The post African Guyanese contributions are evident in critical sectors – ERC appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/african-guyanese-contributions-are-evident-in-critical-sectors-erc/",
      "image": null,
      "published": 1690881016,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "13 boats destroyed, 6 damaged in fire at Vreed-en-Hoop Stelling",
      "description": "Some 19 boats that were docked at the Vreed-en-Hoop Stelling, West Bank Demerara, caught on fire in the wee hours of today. According to the Guyana Fire Service, 13 of the boats were completely destroyed, while six were slightly damaged. The GFS said the report was made at about :49h today about a fire at […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/13-boats-destroyed-6-damaged-in-fire-at-vreed-en-hoop-stelling/",
      "image": null,
      "published": 1690911842,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Lusignan Prison to centrally house inmates – Prison Director",
      "description": "Guyana’s custodial and correctional facilities are being upgraded to ensure inmates are housed in safe and improved living conditions and so far, the construction of three facilities at the Lusignan Prison along the East Coast Demerara has been completed. Currently, 680 inmates are being accommodated in the new state-of-the-art $1.2 billion Lusignan correctional facility and […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/lusignan-prison-to-centrally-house-inmates-prison-director/",
      "image": null,
      "published": 1690909965,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "210 modern young professional homes underway at LBI",
      "description": "The government has commenced the construction of 210 young professional homes at the La Bonne Intention (LBI) Housing Scheme, East Coast Demerara. The homes come in two styles ─ the single flat unit (bungalow) and the two-storey, similar to those constructed at Prospect and Providence on the East Bank of Demerara. Minister within the Ministry […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/210-modern-young-professional-homes-underway-at-lbi/",
      "image": null,
      "published": 1690909030,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Govt welcomes private sector investment in infrastructure – Finance Minister",
      "description": "The government is welcoming private investment in public infrastructure as it contributes to the administration’s vision of transforming Guyana with the recent economic expansion. In the past, public infrastructure has always been viewed as the government’s responsibility, but now there have been many investments by private companies in the sector. And, according to Senior Minister […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/govt-welcomes-private-sector-investment-in-infrastructure-finance-minister/",
      "image": null,
      "published": 1690908726,
      "code": "gy",
      "category": "finance"
   },
   {
      "title": "Vehicle smuggling esp. at Lethem border an ongoing challenge – GRA",
      "description": "Notwithstanding the progress that has been made to tackle smuggling over the years, vehicle smuggling remains a challenge that the Guyana Revenue Authority (GRA) is doing its utmost to confront. On Monday, GRA Commissioner General, Godfrey Statia, appeared before the Parliamentary Public Account Committee (PAC) and was asked about illegal vehicles in Guyana. The Auditor […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/vehicle-smuggling-esp-at-lethem-border-an-ongoing-challenge-gra/",
      "image": null,
      "published": 1690896867,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Aspiring lawyer crowned Region 5 Emancipation Queen",
      "description": "A second-year University of Guyana (UG) law student, Ashana Gordon, copped the coveted Miss Region Five Emancipation Pageant Queen title. The event which was held on the lawns of the Fort Wellington Secondary School in Hopetown on Saturday saw Ashana Gordon being crowned queen. Eight young ladies representing various villages in Region Five (Mahaica-Berbice) participated […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/aspiring-lawyer-crowned-region-5-emancipation-queen/",
      "image": null,
      "published": 1690891229,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Emancipation Day Messages 2023",
      "description": "PM Phillips urges Afro-Guyanese to continue make invaluable marks in development, transformation of Guyana  My fellow Guyanese, I extend hearty Emancipation greetings to all of Guyana, especially our Afro-Guyanese brothers and sisters, as we commemorate the 185th anniversary of the complete freedom of African enslaved people after more than 400 years of slavery. Emancipation Day […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/emancipation-day-messages-2023/",
      "image": null,
      "published": 1690887631,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "African achievements have touched all spheres of life – Pres. Ali in Emancipation Day message",
      "description": "See below for President Dr Irfaan Ali’s Emancipation Day 2023 Message: I extend heartfelt greetings to all Guyanese, but especially our African-Guyanese community, on the occasion of Emancipation Day 2023. The 185th anniversary of the formal abolition of slavery is an occasion to recall the heroic resistance and resilience of our African ancestors. They laid […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/african-achievements-have-touched-all-spheres-of-life-pres-ali-in-emancipation-day-message/",
      "image": null,
      "published": 1690885823,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Guyana is the golden ticket to fast track oil production – Hess boss tells shareholders",
      "description": "Kaieteur News – Guyana’s Stabroek Block has proven to be the golden ticket for Hess Corporation, as the company recently reported that the offshore asset is projected to propel its profit margin with a stunning annual growth rate of over 10%. The Chief Executive Officer (CEO), John Hess, unveiled the massive potential of the Stabroek Block […] The post Guyana is the golden ticket to fast track oil production – Hess boss tells shareholders appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/guyana-is-the-golden-ticket-to-fast-track-oil-production-hess-boss-tells-shareholders/",
      "image": null,
      "published": 1690952344,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Oil companies ‘stealing’ GRA trained auditors with big $$$ – Statia tells Parliamentary Committee",
      "description": "Kaieteur News – As petroleum activities ramp up in Guyana, a key unit established by the Guyana Revenue Authority (GRA) to review the expenses of oil companies operating in the country is presently grossly understaffed, with the agency anticipating that the gap will plugged in a few years’ time. This troubling revelation was made during the […] The post Oil companies ‘stealing’ GRA trained auditors with big $$$ – Statia tells Parliamentary Committee appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/oil-companies-stealing-gra-trained-auditors-with-big-statia-tells-parliamentary-committee/",
      "image": null,
      "published": 1690952294,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Fire destroys 13 water taxis at Vreed-en-Hoop stelling",
      "description": "…Watchman arrested Kaieteur News – Thirteen water taxis are destroyed and another six slightly damaged following a fire at the Vreed-en-Hoop stelling around :49 hrs on Tuesday morning. Police have detained a watchman (security guard) stationed at the stelling for questioning as the Guyana Fire Service (GFS) continues its investigation to determine the cause of […] The post Fire destroys 13 water taxis at Vreed-en-Hoop stelling appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/fire-destroys-13-water-taxis-at-vreed-en-hoop-stelling/",
      "image": null,
      "published": 1690952257,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "ExxonMobil’s US$10B 4th oil project set to extract 900M oil barrels",
      "description": "…already 60% complete Kaieteur News – ExxonMobil’s fourth development, the Yellowtail project, is approximately 60% complete and is on track for first oil in 2025, according to Greg Hill, Hess Corporation’s President and Chief Operating Officer. Hess is ExxonMobil’s Stabroek Block partner, alongside CNOOC. The Yellowtail project’s gross production capacity is estimated at around 250, […] The post ExxonMobil’s US$10B 4th oil project set to extract 900M oil barrels appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/exxonmobils-us10b-4th-oil-project-set-to-extract-900m-oil-barrels/",
      "image": null,
      "published": 1690952178,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Bicycle bandits rob and kill Guyanese re-migrant",
      "description": "Kaieteur News – A Guyanese re-migrant, who returned from neighbouring Venezuela two months ago, was on Saturday night killed by bicycle bandits. Dead is Fazal Khan better known as ‘Chris’. Khan and his colleague from work were reportedly pounced on by bicycle bandits at the corner of Regent and Wellington Streets, Georgetown. The two men […] The post Bicycle bandits rob and kill Guyanese re-migrant appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/bicycle-bandits-rob-and-kill-guyanese-re-migrant/",
      "image": null,
      "published": 1690952148,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Forde slams Govt. move to import nurses",
      "description": "…says locals are being underpaid Kaieteur News – Shadow Attorney General and Minister of Legal Affairs, Roysdale Forde has called out the Government of Guyana for its failure to improve working condition of local health care providers but is ready to import foreign nurses to fill the shortage in the system. During his last press […] The post Forde slams Govt. move to import nurses appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/forde-slams-govt-move-to-import-nurses/",
      "image": null,
      "published": 1690952049,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "Emancipation Day 2023",
      "description": "– A Celebration of Freedom and Unity Kaieteur News – Hundreds of Guyanese gathered at the National Park on Tuesday to celebrate Emancipation Day, a significant occasion that honors the emancipation of enslaved Africans. Local artists performed the striking “Jonkonnu” dance, a colorful and rhythmic expression of emancipation and resilience, originally practiced by enslaved Africans […] The post Emancipation Day 2023 appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/emancipation-day-2023/",
      "image": null,
      "published": 1690952014,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Education Ministry to spend $221M to rehabilitate six dormitories",
      "description": "Kaieteur News – The Ministry of Education will soon be rehabilitating six secondary school dormitories at an estimated cost of $221,,872. During a recent opening of tenders it was revealed that works are slated for the male and female Mahaicony Secondary School dormitories, Santa Rosa Boys’ School dormitory in Region One, Aishalton Secondary School male […] The post Education Ministry to spend $221M to rehabilitate six dormitories appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/education-ministry-to-spend-221m-to-rehabilitate-six-dormitories/",
      "image": null,
      "published": 1690951934,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Mocha teen drowns during creek outing with friends",
      "description": "Kaieteur News – A 17-year-old resident of Mocha, East Bank Demerara (EBD) reportedly drowned on Saturday at Chanta Creek, Soesdyke Linden Highway while out with friends. Dead is Myles Munroe. Police reported that on Saturday Munroe and a group of friends went to the creek at about 13:00h. The reports are that after spending sometime […] The post Mocha teen drowns during creek outing with friends appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/mocha-teen-drowns-during-creek-outing-with-friends/",
      "image": null,
      "published": 1690951874,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Real Estate, Data Protection Bills for second reading on Thursday",
      "description": "Kaieteur News – The Real Estate Agents and Brokers Bill and The Data Protection Bill 2023 are among a number of incoming legislation set for second reading in the National Assembly on Thursday. The bills will be read at the next sitting of the House slated for August 3, 2023. According to the Order Paper […] The post Real Estate, Data Protection Bills for second reading on Thursday appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/real-estate-data-protection-bills-for-second-reading-on-thursday/",
      "image": null,
      "published": 1690951814,
      "code": "gy",
      "category": "finance"
   },
   {
      "title": "BVI trade delegation seeking closer ties",
      "description": "Kaieteur News – A 16-member delegation from the British Virgin Islands is in Guyana to explore trade, investment and enhanced cooperation with Guyana. The BVI team is led by the Hon. Lorna Smith, Deputy Premier and Minister for Financial Services, Labour and Trade, Government of the British Virgin Islands, the Department of Public Information said […] The post BVI trade delegation seeking closer ties appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/bvi-trade-delegation-seeking-closer-ties/",
      "image": null,
      "published": 1690951754,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Essential health services continue to face significant disruptions three years into pandemic: PAHO regional report",
      "description": "Kaieteur News – The Director of the Pan American Health Organization (PAHO), Dr Jarbas Barbosa, called on countries of the Americas to maintain investments in health, promote innovation in primary care with a focus on digital technologies, and move from theory to practice through specific policies to overcome challenges in access to health services. “At […] The post Essential health services continue to face significant disruptions three years into pandemic: PAHO regional report appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/essential-health-services-continue-to-face-significant-disruptions-three-years-into-pandemic-paho-regional-report/",
      "image": null,
      "published": 1690951709,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "Spending oil revenues wildly guaranteed to steer Guyana off pathway of transformative development – Economist warns",
      "description": "Kaieteur News – Guyana, with its rapidly increasing oil production, is set to experience remarkable economic growth, projected to rise by approximately 30 percent annually during the period 2023-2026. This was outlined in the International Monetary Fund’s (IMF) 2022 Article IV Consultation Report. That very document also indicates that the nation’s commercially recoverable petroleum reserves […] The post Spending oil revenues wildly guaranteed to steer Guyana off pathway of transformative development – Economist warns appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/spending-oil-revenues-wildly-guaranteed-to-steer-guyana-off-pathway-of-transformative-development-economist-warns/",
      "image": null,
      "published": 1690951635,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Guyana, China to increase collaboration in trade and infrastructure",
      "description": "Kaieteur News – Guyana and China have committed to expanding their collaboration in the areas of trade and infrastructure. The countries have resolved to deepen ties through continued partnership during a recent meeting between President Irfaan Ali and China’s President Xi Jinping. Last Friday, President Ali met with President Xi Jinping in Chengdu, capital city […] The post Guyana, China to increase collaboration in trade and infrastructure appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/guyana-china-to-increase-collaboration-in-trade-and-infrastructure/",
      "image": null,
      "published": 1690951562,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Gov’t. welcomes private sector investment in infrastructure – Min. Singh",
      "description": "Kaieteur News – The government is welcoming private investment in public infrastructure as it contributes to the administration’s vision of transforming Guyana with the recent economic expansion. In the past, public infrastructure has always been viewed as the government’s responsibility, but now there have been many investments by private companies in the sector. And, according […] The post Gov’t. welcomes private sector investment in infrastructure – Min. Singh appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/govt-welcomes-private-sector-investment-in-infrastructure-min-singh/",
      "image": null,
      "published": 1690951514,
      "code": "gy",
      "category": "finance"
   },
   {
      "title": "Afro-Guyanese will not be politically, economically marginalized – Pres. Ali",
      "description": "Kaieteur News – President Mohamed Irfaan Ali on Tuesday promised that his government will not marginalize Afro-Guyanese. The President was at the time delivering his Emancipation Day 2023 message. “The greatest tribute we can pay to the struggles and sacrifices of African Guyanese is to build a free, prosperous and more inclusive nation. In this […] The post Afro-Guyanese will not be politically, economically marginalized – Pres. Ali appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/afro-guyanese-will-not-be-politically-economically-marginalized-pres-ali/",
      "image": null,
      "published": 1690951453,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "210 modern young professional homes underway at LBI, ECD",
      "description": "Kaieteur News – The government has commenced the construction of 210 young professional homes at the La Bonne Intention (LBI) Housing Scheme, East Coast Demerara. The homes come in two styles ─ the single flat unit (bungalow) and the two-storey, similar to those constructed at Prospect and Providence on the East Bank of Demerara. Minister […] The post 210 modern young professional homes underway at LBI, ECD appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/210-modern-young-professional-homes-underway-at-lbi-ecd/",
      "image": null,
      "published": 1690951393,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Demarco, Gaza Slim, and Pumpatte to sizzle at ‘Summer Fest Reload’",
      "description": "Kaieteur News – Popular dancehall artistes Demarco, Gaza Slim and Pumpatte will be performing in Guyana on August 5, 2023 at the Summer Fest Reload scheduled for the National Park, Georgetown. According to Elite Production, promoter of the show, the highly anticipated event promises to be an unforgettable night of thrilling performances. Demarco, the Jamaican dancehall […] The post Demarco, Gaza Slim, and Pumpatte to sizzle at ‘Summer Fest Reload’ appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/demarco-gaza-slim-and-pumpatte-to-sizzle-at-summer-fest-reload/",
      "image": null,
      "published": 1690951357,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Hard Truths by GHK Lall – PPP Govt. – Three Years of The Commercial, Three Years of The Malarial",
      "description": "Kaieteur News – What have Guyanese had for the last three years under the PPP Government?  What has President Ali and VP Jagdeo presented that comforts all citizens? How do global presences assess Guyana? Where are Guyanese amid the gleam of galloping events? How do they manage, reconcile, where they should be? Ask the President […] The post Hard Truths by GHK Lall – PPP Govt. – Three Years of The Commercial, Three Years of The Malarial appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/hard-truths-by-ghk-lall-ppp-govt-three-years-of-the-commercial-three-years-of-the-malarial/",
      "image": null,
      "published": 1690951292,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Lining Up – A Lost Art in Guyana",
      "description": "Dem Boys Seh… Kaieteur News – It seems we gat ourselves a national pastime: boring lines and creating chaos. Whether is dem traffic lines on de roads or de line in dem supermarket, Guyanese losing discipline and yuh does always find people trying fuh bore de line. It mek dem boys want to call for […] The post Lining Up – A Lost Art in Guyana appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/lining-up-a-lost-art-in-guyana/",
      "image": null,
      "published": 1690951217,
      "code": "gy",
      "category": "technology"
   },
   {
      "title": "Akili Haynes and Priyanna Ramdhani headline the winners of  World Badminton Day tourney",
      "description": "Kaieteur Sports – The Guyana Badminton Association World Badminton Day Tournament 2023 concluded on Saturday, July 29, 2023 after three competitive day of Badminton at the National Gymnasium and at the conclusion, Akili Haynes and Priyanna Ramdhani headlined the winners in the respective categories. The Winners of the Total Solutions World Badminton Day Tournament 2023 […] The post Akili Haynes and Priyanna Ramdhani headline the winners of  World Badminton Day tourney appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/akili-haynes-and-priyanna-ramdhani-headline-the-winners-of-world-badminton-day-tourney/",
      "image": null,
      "published": 1690951180,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "The organisers and stables working at fever pitch for Guyana Cup 2023",
      "description": "Kaieteur Sports – The organisers and stables are leading the charge at fever pitch in preparation for the Guyana Cup Horserace meet set for August 13th at the Rising Sun Turf Club. Organised by the Jumbo Jet Thoroughbred Racing Committee (JJTRC) Guyana Cup horserace meet and running at the Rising Sun Turf Club at West […] The post The organisers and stables working at fever pitch for Guyana Cup 2023 appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/the-organisers-and-stables-working-at-fever-pitch-for-guyana-cup-2023/",
      "image": null,
      "published": 1690951110,
      "code": "gy",
      "category": "entertainment"
   },
   {
      "title": "India secures 2-1 ODI series win after dominant 200-run victory in Tarouba",
      "description": "SportsMax – India completed a 2-1 ODI series win over the West Indies with a mammoth 200-run win in the third ODI at the Brian Lara Cricket Academy in Tarouba yesterday. India made 351-5 off their 50 overs, their highest ODI total in the West Indies, after being put in to bat by the hosts. […] The post India secures 2-1 ODI series win after dominant 200-run victory in Tarouba appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/india-secures-2-1-odi-series-win-after-dominant-200-run-victory-in-tarouba/",
      "image": null,
      "published": 1690951051,
      "code": "gy",
      "category": "technology"
   },
   {
      "title": "Alex Leung and Brighton John dominates Flying Ace Cycling Club (FACC) organised 50-mile road",
      "description": "Kaieteur Sports – Top junior cyclist Alex Leung and teammate Brighton John rode away with the Flying Ace Cycling Club (FACC) organised 50-mile road race on Sunday along the Corentyne highway. The two cyclist of the Team United Cycle Club crossed the line together to take the first two spots in the race which was sponsored […] The post Alex Leung and Brighton John dominates Flying Ace Cycling Club (FACC) organised 50-mile road appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/alex-leung-and-brighton-john-dominates-flying-ace-cycling-club-facc-organised-50-mile-road/",
      "image": null,
      "published": 1690950960,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "Brampton Gladiators are ORSCA/Imran Ali Real Estate 15-overs champion",
      "description": "Kaieteur Sports – Brampton Gladiators pulled off a thrilling three-wicket win off the last ball against defending champions Masters in the 2023 Ontario Round-Arm Softball Cricket Association (ORSCA)/Imran Ali Real Estate 15-overs knockout competition. Playing at Emancipation Park at Dixee-407 ground in Brampton, Ontario, on Sunday, Brampton Gladiators were set 109 for victory and ended […] The post Brampton Gladiators are ORSCA/Imran Ali Real Estate 15-overs champion appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/02/brampton-gladiators-are-orsca-imran-ali-real-estate-15-overs-champion/",
      "image": null,
      "published": 1690950916,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Gov’t halting mining at Chinese Landing temporarily",
      "description": "Following a resolution by the Inter-American Commission on Human Rights on Chinese Landing, the government today announced a temporary halt of mining in the indigenous community. The article Gov’t halting mining at Chinese Landing temporarily appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/govt-halting-mining-at-chinese-landing-temporarily/",
      "image": null,
      "published": 1691019324,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Brazil’s Lula: Amazon countries summit to build common rainforest policy for first time",
      "description": "BRASILIA,  (Reuters) – Brazil President Luiz Inacio Lula da Silva today said that next week’s summit of Amazon region nations will seek to draw up a common policy for the first time to protect the rainforest. The article Brazil’s Lula: Amazon countries summit to build common rainforest policy for first time appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/regional/brazils-lula-amazon-countries-summit-to-build-common-rainforest-policy-for-first-time/",
      "image": null,
      "published": 1690998431,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Detectives probing murder of shopkeeper at Surinamo Landing",
      "description": "Detectives are probing the murder of 55-year-old Andrew Harris, called ‘Shortman’, a shopkeeper at Surinamo Landing, Mazaruni River. The article Detectives probing murder of shopkeeper at Surinamo Landing appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/detectives-probing-murder-of-shopkeeper-at-surinamo-landing/",
      "image": null,
      "published": 1690985006,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Former Head of Presidential Secretariat Roger Luncheon passes away",
      "description": "Former long-serving Head of the Presidential Secretariat (HPS) and senior PPP member Dr Roger Luncheon passed away today. The article Former Head of Presidential Secretariat Roger Luncheon passes away appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/former-head-of-presidential-secretariat-luncheon-passes-away/",
      "image": null,
      "published": 1690979464,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Fire destroys 13 speedboats at Vreed-en-Hoop stelling",
      "description": "By Joseph Allen Thirteen speedboat operators are now counting their losses while pondering their next move after an early morning fire ripped through their boats which were moored at the Vreed-en-Hoop Stelling, West Coast Demerara. The article Fire destroys 13 speedboats at Vreed-en-Hoop stelling appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/fire-destroys-13-speedboats-at-vreed-en-hoop-stelling/",
      "image": null,
      "published": 1690957163,
      "code": "gy",
      "category": "science"
   },
   {
      "title": "Gov’t committed to ensuring African Guyanese never marginalised – President",
      "description": "In his message yesterday to mark Emancipation Day, President Irfaan Ali asserted that his government is committed to ensuring that African Guyanese are never politically or economically marginalized. The article Gov’t committed to ensuring African Guyanese never marginalised – President appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/govt-committed-to-ensuring-african-guyanese-never-marginalised-president/",
      "image": null,
      "published": 1690957109,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Bulletin to be issued for ‘Killa’ over death of guard",
      "description": "A bulletin will be issued for the man known as ‘Killa’, who is wanted for the shooting death of 25-year-old security officer, Gerald Sobers, Crime Chief Wendell Blanhum said on Monday evening. The article Bulletin to be issued for ‘Killa’ over death of guard appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/bulletin-to-be-issued-for-killa-over-death-of-guard/",
      "image": null,
      "published": 1690957040,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "PAC members urge contracts for GRA employees",
      "description": "As the Public Accounts Committee (PAC) of Parliament met on Monday, a call was made for contracts for those Guyana Revenue Authority (GRA) employees who are being trained to monitor the Oil and Gas operations in Guyana. The article PAC members urge contracts for GRA employees appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/pac-members-urge-contracts-for-gra-employees/",
      "image": null,
      "published": 1690956987,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Mocha boy, 17, suspected to have drowned at Soesdyke Creek",
      "description": "Police are investigating the alleged drowning of 17-year-old Myles Munroe, a Customer Service Agent of Qualfon, Providence, East Bank Demerara, which occurred over the weekend at Chanta Creek, Soesdyke-Linden Highway. The article Mocha boy, 17, suspected to have drowned at Soesdyke Creek appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/mocha-boy-17-suspected-to-have-drowned-at-soesdyke-creek/",
      "image": null,
      "published": 1690956922,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Two gunmen rob owners, employee of Alexander St store",
      "description": "Two Chinese nationals and an employee were robbed during an armed attack at the Jet Chinese store located on Alexander Street, Georgetown, last Saturday afternoon. The article Two gunmen rob owners, employee of Alexander St store appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/two-gunmen-rob-owners-employee-of-alexander-st-store/",
      "image": null,
      "published": 1690956864,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "APA slams gov’t’s response to IACHR’s resolution on Chinese Landing",
      "description": "The Amerindian Peoples Association (APA) is disappointed with the government’s response to the Inter-American Commission on Human Rights (IACHR) resolution concerning the Chinese Landing Village. The article APA slams gov’t’s response to IACHR’s resolution on Chinese Landing appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/apa-slams-govts-response-to-iachrs-resolution-on-chinese-landing/",
      "image": null,
      "published": 1690956831,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Vehicle donated to Lethem Fire Station",
      "description": "Tony’s Auto Spares on Thursday donated a Toyota Hilux, valued at $14 million, to the Lethem Fire Station. The article Vehicle donated to Lethem Fire Station appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/vehicle-donated-to-lethem-fire-station/",
      "image": null,
      "published": 1690956759,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Gov’t states `unwavering commitment’ to battle human trafficking",
      "description": "The government on Friday stated its “unwavering commitment” to fight human trafficking and dismantle networks and prosecute perpetrators. The article Gov’t states `unwavering commitment’ to battle human trafficking appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/govt-states-unwavering-commitment-to-battle-human-trafficking/",
      "image": null,
      "published": 1690956702,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Reflect on implications of Emancipation Day – PNCR",
      "description": "Calling  on Guyanese to reflect on the deep implications of Emancipation Day, the PNC Reform (PNCR) on Monday bemoaned what it said was the ongoing loss of freedoms. The article Reflect on implications of Emancipation Day – PNCR appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/reflect-on-implications-of-emancipation-day-pncr/",
      "image": null,
      "published": 1690956622,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Nightmare defeat! - — Windies series dream goes up in flames after 200-run mauling",
      "description": "TAROUBA, Trinidad, CMC – West Indies’ hopes of a long-awaited series win over India were ruthlessly shattered here yesterday, when they suffered a 200-run annihilation in the decisive third One-Day International at Brian Lara Stadium. The article Nightmare defeat! appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/sports/nightmare-defeat/",
      "image": null,
      "published": 1690956561,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "Citizens Bank launches mortgage promotion, $5m in cash prizes up for grabs",
      "description": "Citizens Bank Guyana Inc on Monday launched a mortgage promotion and said that cash prizes totalling $5m are up for grabs. The article Citizens Bank launches mortgage promotion, $5m in cash prizes up for grabs appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/citizens-bank-launches-mortgage-promotion-5m-in-cash-prizes-up-for-grabs/",
      "image": null,
      "published": 1690956557,
      "code": "gy",
      "category": "finance"
   },
   {
      "title": "Shariff leads GCF/Diamond Insurance Women’s Chess Championship Qualifiers",
      "description": "With only three rounds remaining in the Diamond Insurance Women’s Chess Championship Qualifiers, former women’s champion Sasha Shariff is in sole possession of the lead as she attempts to reclaim the coveted title held by Pooja Lam who will not be defending her crown this year. The article Shariff leads GCF/Diamond Insurance Women’s Chess Championship Qualifiers appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/sports/shariff-leads-gcf-diamond-insurance-womens-chess-championship-qualifiers/",
      "image": null,
      "published": 1690956531,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Guyana taking steps to company hepatitis – ministry",
      "description": "Guyana has taken proactive measures to address the backlog of over 280 suspected cases of hepatitis C, a release from the Ministry of Health said on Friday. The article Guyana taking steps to company hepatitis – ministry appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/guyana-taking-steps-to-company-hepatitis-ministry/",
      "image": null,
      "published": 1690956507,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Who’s who in Guyana’s U13 cricket team",
      "description": "Beginning today, a Guyana U13 cricket team will oppose their Trinidad counterparts in a bilateral series of four matches in the Twin Island Republic. The article Who’s who in Guyana’s U13 cricket team appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/sports/whos-who-in-guyanas-u13-cricket-team/",
      "image": null,
      "published": 1690956477,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Construction started on 210 young professional homes at LBI",
      "description": "As part of its affordable housing drive, the government has commenced the construction of 210 young- professional homes at the La Bonne Intention (LBI) Housing Scheme, East Coast Demerara, according to a Department of Public Information (DPI) release on Monday. The article Construction started on 210 young professional homes at LBI appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/construction-started-on-210-young-professional-homes-at-lbi/",
      "image": null,
      "published": 1690956429,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Guyana U19s draw with Windwards",
      "description": "Guyana Under-19 cricketers completed the Cricket West Indies’ Regional three-day tournament with a draw against Windward Islands yesterday. The article Guyana U19s draw with Windwards appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/sports/guyana-u19s-draw-with-windwards/",
      "image": null,
      "published": 1690956415,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Lethem Business incubator providing opportunities for residents – DPI - –Over 500 teabags produced at the agro-processing facility",
      "description": "The Ministry of Tourism, Industry and Commerce’s Small Business Bureau (SBB) is developing ways to support small business owners from Region Nine to improve their lives, the Department of Public Information (DPI) said. The article Lethem Business incubator providing opportunities for residents – DPI appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/lethem-business-incubator-providing-opportunities-for-residents-dpi/",
      "image": null,
      "published": 1690956400,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Exxon Mobil in talks with Tesla, Ford to supply lithium – Bloomberg Law",
      "description": "(Reuters) -Oil major Exxon Mobil is in talks with Tesla, Ford Motor, Volkswagen and other automakers to supply lithium for electric vehicle batteries, Bloomberg Law reported on Monday, citing people familiar with the matter. The article Exxon Mobil in talks with Tesla, Ford to supply lithium – Bloomberg Law appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/exxon-mobil-in-talks-with-tesla-ford-to-supply-lithium-bloomberg-law/",
      "image": null,
      "published": 1690956326,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Costa Rica prosecutor opens case into president for ‘influence peddling’",
      "description": "SAN JOSE,  (Reuters) – Costa Rica’s top prosecutor has opened a case against President Rodrigo Chaves and various other government officials for allegations of “influence peddling,” the Attorney General’s office confirmed on Tuesday. The article Costa Rica prosecutor opens case into president for ‘influence peddling’ appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/regional/costa-rica-prosecutor-opens-case-into-president-for-influence-peddling/",
      "image": null,
      "published": 1690956321,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "One Guyana T10 Super 8s head to Enmore August 5",
      "description": "The final three semi-finalists will be decided when the Kares One Guyana T10 Tapeball tournament’s Super 8 stage bowls off at the Enmore Community Centre August 5. The article One Guyana T10 Super 8s head to Enmore August 5 appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/sports/one-guyana-t10-super-8s-head-to-enmore-august-5/",
      "image": null,
      "published": 1690956319,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Barbados businessman facing extradition to USA",
      "description": "(Barbados Nation) Barbadian businessman Alex Tasker has been taken into police custody. The article Barbados businessman facing extradition to USA appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/regional/barbados-businessman-facing-extradition-to-usa/",
      "image": null,
      "published": 1690956289,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Emancipation Festival a colourful success",
      "description": "By Mia Anthony Guyanese turned out in droves in bright sunshine at the National Park in Georgetown yesterday as the country celebrated the 185th anniversary of emancipation from slavery. The article Emancipation Festival a colourful success appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/emancipation-festival-a-colourful-success/",
      "image": null,
      "published": 1690956279,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "GBA badminton camp underway",
      "description": "The Guyana Badminton Association (GBA) is currently hosting its 2023 Summer Camp. The article GBA badminton camp underway appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/sports/gba-badminton-camp-underway/",
      "image": null,
      "published": 1690956240,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Africans are not in a happy place today",
      "description": "Dear Editor, “Free at last. Free at last. Thank God almighty, we are free at last.” The article Africans are not in a happy place today appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/opinion/letters/africans-are-not-in-a-happy-place-today/",
      "image": null,
      "published": 1690956239,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Son of Colombia’s president pleads not guilty to money laundering charges",
      "description": "BOGOTA,  (Reuters) – The eldest son of Colombian President Gustavo Petro, Nicolas Petro, on Tuesday pled not guilty to charges of money laundering and illicit enrichment at a court in the capital. The article Son of Colombia’s president pleads not guilty to money laundering charges appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/regional/son-of-colombias-president-pleads-not-guilty-to-money-laundering-charges/",
      "image": null,
      "published": 1690956227,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Jamaica whip Barbados to complete double",
      "description": "KINGSTOWN, St Vincent, CMC – Clinical Jamaica defeated Barbados by 56 runs to complete the double in the Rising Stars Under-19 Championship. The article Jamaica whip Barbados to complete double appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/sports/jamaica-whip-barbados-to-complete-double/",
      "image": null,
      "published": 1690956220,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Aspiring psychologist wins Bartica’s Miss Emancipation Pageant",
      "description": "By Deneita Fredericks After a 10-year absence, the Bartica Miss Emancipation Pageant took centre stage on Monday at the Bartica Community Centre Ground and Tytheon Jones, an aspiring psychologist, walked away with the crown. The article Aspiring psychologist wins Bartica’s Miss Emancipation Pageant appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/aspiring-psychologist-wins-barticas-miss-emancipation-pageant/",
      "image": null,
      "published": 1690956208,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Rosignol, Paradise stay unbeaten after stalemate",
      "description": "Heavyweights and undefeated sides Rosignol United and Paradise Invaders played to a 1-1 stalemate when the Berbice Football Association (BFA) Senior Men’s League continued Sunday evening. The article Rosignol, Paradise stay unbeaten after stalemate appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/sports/rosignol-paradise-stay-unbeaten-after-stalemate/",
      "image": null,
      "published": 1690956169,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "PM meets Chair of Digicel Group",
      "description": "Prime Minister Mark Phillips on July 25 met with the founder and Chairman of the Digicel Group,  Denis O’Brien, along with several executives from Digicel Guyana, at his office in Georgetown. The article PM meets Chair of Digicel Group appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/pm-meets-chair-of-digicel-group/",
      "image": null,
      "published": 1690956162,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Emancipation Day image",
      "description": "Dear Editor, Emancipation Day 2023 and there is an image of  a Black woman on your front page, in torment. The article Emancipation Day image appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/opinion/letters/emancipation-day-image/",
      "image": null,
      "published": 1690956140,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Guatemala president meets with OAS head, says committed to ensure elections",
      "description": "GUATEMALA CITY, (Reuters) – Guatemalan President Alejandro Giammattei yesterday met with the Organization of American States chief Luis Almagro and expressed his commitment to ensuring peaceful elections in the country, he said in a post on messaging platform X on Tuesday. The article Guatemala president meets with OAS head, says committed to ensure elections appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/regional/guatemala-president-meets-with-oas-head-says-committed-to-ensure-elections/",
      "image": null,
      "published": 1690956120,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "A transparent fishing expedition",
      "description": "Dear Editor, I find fascinating the cleverness of Mr. Robin Singh, on his lovely missive titled, `Every reason listed by GHK Lall for not engaging against gold smuggling faced by CANU’ (SN, August ). The article A transparent fishing expedition appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/opinion/letters/a-transparent-fishing-expedition/",
      "image": null,
      "published": 1690956110,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Back in nets, NZ’s Williamson racing against time for World Cup",
      "description": "(Reuters) – Recovering New Zealand captain Kane Williamson returned to the net yesterday to face throwdowns keeping alive his faint hopes of playing the 50-overs World Cup in India later this year. The article Back in nets, NZ’s Williamson racing against time for World Cup appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/sports/back-in-nets-nzs-williamson-racing-against-time-for-world-cup/",
      "image": null,
      "published": 1690956109,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Emancipation Festival",
      "description": "The article Emancipation Festival appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/photos/emancipation-festival/",
      "image": null,
      "published": 1690956104,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Third anniversary of PPP/C gov’t",
      "description": "Today marks the third anniversary of the PPP/C government in office and this period could well be evaluated through the prism of the words oil and gas and what they have come to mean for the country and its people. The article Third anniversary of PPP/C gov’t appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/opinion/editorial/third-anniversary-of-ppp-c-govt/",
      "image": null,
      "published": 1690956102,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Insights from the UN’s new agenda for peace",
      "description": "By Dr Bertrand Ramcharan Chief Speech-Writer to the UN Secretary-General (1988-1992); Seventh Chancellor of the University of Guyana In January 1992, the UN Security Council convened at the level of Heads of State and requested the then UN Secretary-General, Boutros Boutros-Ghali to submit to it an agenda for peace highlighting the prevention of conflicts. The article Insights from the UN’s new agenda for peace appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/features/insights-from-the-uns-new-agenda-for-peace/",
      "image": null,
      "published": 1690956102,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Politikles",
      "description": "The article Politikles appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/opinion/politikles/politikles-3324/",
      "image": null,
      "published": 1690956101,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Procurement commission holds open day in Region One",
      "description": "The Public Procurement Commission (PPC) on July 18, 2023, hosted a Public Open Day from 9am – 2:00pm at the Kumaka Waterfront, Region #1 (Barima-Waini). The article Procurement commission holds open day in Region One appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/guyana/procurement-commission-holds-open-day-in-region-one/",
      "image": null,
      "published": 1690956079,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Bahamas promises to join Kenya in security force in Haiti as support grows",
      "description": "(Reuters) – The Bahamian government yesterday welcomed Kenya’s decision to lead a multinational force in Haiti and committed 150 people to support the effort if the United Nations authorizes the force. The article Bahamas promises to join Kenya in security force in Haiti as support grows appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/02/news/regional/bahamas-promises-to-join-kenya-in-security-force-in-haiti-as-support-grows/",
      "image": null,
      "published": 1690956066,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Dr Roger Luncheon has left a legacy of  true commitment to service  – VP",
      "description": "Please see below full statement from Vice President Dr Bharrat Jagdeo:  General Secretary Bharrat Jagdeo extends deepest condolences on behalf of himself and the People’s Progressive Party, to the family, friends, colleagues, and others of Dr. Roger Forbes Luncheon, in light of his passing earlier this morning.Dr. Luncheon served in many capacities, including as Head […] The post Dr Roger Luncheon has left a legacy of  true commitment to service  – VP appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/dr-roger-luncheon-has-left-a-legacy-of-true-commitment-to-service-vp/",
      "image": null,
      "published": 1690977741,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "GRA to re-establish office at Kurupukari Crossing in bid to halt illegal vehicles",
      "description": "…was forced to close office due to corruption – Commissioner General After previously closing down the outpost due to corrupt staff, the Guyana Revenue Authority (GRA) will be re-establishing its office at the Kurupukari Crossing in Region Eight on the border with Brazil. This was confirmed by GRA Commissioner General Godfrey Statia, who appeared before […] The post GRA to re-establish office at Kurupukari Crossing in bid to halt illegal vehicles appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/gra-to-re-establish-office-at-kurupukari-crossing-in-bid-to-halt-illegal-vehicles/",
      "image": null,
      "published": 1690970749,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Emancipation Day 2023 showcases culture, unity, food of ancestors",
      "description": "…as thousands flock parks for picnics, family fun day Once again, this year, the Emancipation celebrations were held at the National Park, drawing thousands of Guyanese together to commemorate the emancipation of slaves in Guyana. This year’s event at the National Park was particularly significant as the African Cultural and Development Association (ACDA) marked the […] The post Emancipation Day 2023 showcases culture, unity, food of ancestors appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/emancipation-day-showcases-culture-unity-food-of-ancestors/",
      "image": null,
      "published": 1690970681,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "NRF Secretariat to be established in 2023 – Chairman",
      "description": "Since the principal Act was passed, the Natural Resource Fund (NRF) has gotten Investment and Public Accountability and Oversight Committees. It will also be getting a secretariat, likely in the second half of 2023. This is according to Chairman of the NRF Board, Major General (retired) Joe Singh, who in the NRF’s inaugural report for […] The post NRF Secretariat to be established in 2023 – Chairman appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/nrf-secretariat-to-be-established-in-2023-chairman/",
      "image": null,
      "published": 1690970598,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Private company proposing to build US$10M solar farm on Linden-Soesdyke Highway",
      "description": "As Guyana continues its trajectory towards the use of more renewable energy in the power grid, a private company is looking to build a 5.8 Megawatt (MW) solar farm on the Soesdyke-Linden Highway and has approached the Environmental Protection Agency (EPA) for approval. According to the project documents, the Loo Creek Solar Farm is being […] The post Private company proposing to build US$10M solar farm on Linden-Soesdyke Highway appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/private-company-looking-to-build-us10m-solar-farm-on-soesdyke-linden-highway/",
      "image": null,
      "published": 1690970573,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Massive fire destroys 13 boats docked at Vreed-en-Hoop Stelling",
      "description": "…6 damaged, watchman in custody A massive fire on Tuesday morning destroyed 13 passenger speed boats and damaged six others docked at the Vreed-en-Hoop Stelling, West Coast Demerara. According to the Guyana Fire Service (GFS), a distress call was received at about :49h regarding a fire raging at the Vreed-en-Hoop Stelling, and swift action was […] The post Massive fire destroys 13 boats docked at Vreed-en-Hoop Stelling appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/massive-fire-destroys-13-boats-docked-at-vreed-en-hoop-stelling/",
      "image": null,
      "published": 1690970498,
      "code": "gy",
      "category": "entertainment"
   },
   {
      "title": "El Dorado Offshore, NATI join forces to foster technical growth in Region 6",
      "description": "El Dorado Offshore (EDO) and the New Amsterdam Technical Institute (NATI) on Friday signed a Memorandum of Understanding (MoU) to strengthen their collaboration and pave the way for a strategic partnership focused on technical education and career opportunities for graduates. “We are thrilled about our partnership with EDO. Together, we will empower students with technical […] The post El Dorado Offshore, NATI join forces to foster technical growth in Region 6 appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/el-dorado-offshore-nati-join-forces-to-foster-technical-growth-in-region-6/",
      "image": null,
      "published": 1690970421,
      "code": "gy",
      "category": "technology"
   },
   {
      "title": "Drinking culture",
      "description": "Alcohol abuse is developing as a major public health problem even as we continue to have much discussions on alcoholism and the negative effects it has on individuals and society as a whole. Alcohol use, and more so alcohol abuse, has always been prevalent in Guyana and in recent years, has moved to a glorification […] The post Drinking culture appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/drinking-culture/",
      "image": null,
      "published": 1690967428,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Dealing  with what…",
      "description": "…we got in oil Some folks still don’t get it. They don’t deny that PNC’s “Nassau” Trotman sold us down the river on the sh*tty oil contract he signed back in 2015. They also know about the sh*tty bonus and royalty he accepted,  unlike what other countries from Africa thru Suriname to Brazil got. But […] The post Dealing  with what… appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/dealing-with-what/",
      "image": null,
      "published": 1690967125,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Bharat Jagdeo is a nightmare for Opposition and their sychophants",
      "description": "Glen Lall did a lot of begging, demanding that the Guyanese people stay at home last Monday, July 31. Overwhelmingly, the Guyanese people paid no attention to him. A couple of months ago, Glen Lall’s across-the-country walk to demand renegotiation of the EXXON contract failed. No more than a handful of persons walked, and other […] The post Bharat Jagdeo is a nightmare for Opposition and their sychophants appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/bharat-jagdeo-is-a-nightmare-for-opposition-and-their-sychophants/",
      "image": null,
      "published": 1690966838,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "MV MA Lisha to set sail on inaugural trip to NWD next week",
      "description": "The new and eagerly anticipated $2.5 billion (US$12.7M) MV MA Lisha will depart Port Georgetown on Thursday, August 10, 2023, at 16:00hrs (4PM) for its inaugural trip to Region One. MV MA Lisha will then return to Georgetown from Kumaka, Region One on Tuesday, August 15, 2023, at 16:00hrs (4PM), according to the Public Works […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/mv-ma-lisha-to-set-sail-on-inaugural-trip-to-nwd-next-week/",
      "image": null,
      "published": 1691016164,
      "code": "gy",
      "category": "entertainment"
   },
   {
      "title": "Police Commander, driver injured in EBD collision",
      "description": "Police Commander of Regional Division 4 (B), Senior Superintendent Mahendra Singh, and his driver were injured in an accident at Friendship, East Bank Demerara, this morning. The ‘serious accident’ occurred at around :15h today on the Friendship Public Road, EBD, involving motor Pickup PAC 5254, owned by the Guyana Police Force, and a motor lorry […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/police-commander-driver-injured-in-ebd-collision/",
      "image": null,
      "published": 1691014908,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "NAREI, USAID advance discussion on climate-smart agriculture",
      "description": "Guyana’sNational Agricultural Research and Extension Institute (NAREI) has advanced discussions on climate-smart agriculture with the United States Agency for International Development (USAID)’s Mission in the Eastern and Southern Caribbean (ESC). NAREI’s Chief Executive Officer (CEO), Jagnarine Singh, Research Scientists David Fredericks, and Dr. K Bramdeo recently met with the USAID representatives. Climate-smart agriculture (CSA) is […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/narei-usaid-advance-discussion-on-climate-smart-agriculture/",
      "image": null,
      "published": 1691011207,
      "code": "gy",
      "category": "technology"
   },
   {
      "title": "GTA staff benefitting from int’l training courses to foster tourism development",
      "description": "To further develop more tourism products and services, and to better train persons from various villages across the country, the Guyana Tourism Authority (GTA) has implemented international training for its staff. Recently, GTA employees participated in the virtual Food Safety Training Session, which was led by Yvon Bertrand of the Canadian Executive Service Organisation (CESO). […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/gta-staff-benefitting-from-intl-training-courses-to-foster-tourism-development/",
      "image": null,
      "published": 1691011022,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "US Health Advisors partner with MoH to strengthen COVID-19 response, public health supply chain",
      "description": "The United States Government, through the United States Agency for International Development (USAID), is partnering with the Guyana Ministry of Health to support Guyana’s public health infrastructure. USAID’s Country Health Information Systems and Data Use (CHISU) Program, a flagship data and information system project of USAID’s Bureau for Global Health, is providing two global public […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/us-health-advisors-partner-with-moh-to-strengthen-covid-19-response-public-health-supply-chain/",
      "image": null,
      "published": 1691010620,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "AG Nandlall laments “unsatisfactory” progress of electoral fraud cases",
      "description": "On the three-year anniversary of the People’s Progressive Party/Civic Government being sworn into office and more than two years after several of the key players behind those blatant attempts to steal the March 2020 elections were slapped with fraud charges, those cases continue to languish in the Magistrates’ Court. During his weekly programme, Attorney General […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/ag-nandlall-laments-unsatisfactory-progress-of-electoral-fraud-cases/",
      "image": null,
      "published": 1691004569,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Honourary Consul calls for govts’ intervention over poor service by interCaribbean Airways",
      "description": "See below for a statement from the Guyana Honorary Consul in Antigua and Barbuda, Mr. Robert Reis, on interCaribbean Airways’ services in the region:  The Guyana Honorary Consul in Antigua and Barbuda, Robert Reis, wishes to express deep concern over recent customer service experiences reported in connection with InterCaribbean Airlines. In the past six weeks, […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/honourary-consul-calls-for-govts-intervention-over-poor-service-by-intercaribbean-airways/",
      "image": null,
      "published": 1690999806,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Ghana-Guyana Local Content Conference set for Aug 10 in Georgetown",
      "description": "The much-anticipated two-day Ghana-Guyana Local Content Conference is scheduled to get underway on Thursday, August 10, at the Marriott Hotel in Georgetown, Guyana. This first edition of the special conference, which is to rotate between the two countries, is organised by the Ghana Chamber of Commerce Guyana, with support from the Ministry of Natural Resources […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/ghana-guyana-local-content-conference-set-for-aug-10-in-georgetown/",
      "image": null,
      "published": 1690994073,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Mazaruni shopkeeper fatally stabbed; co-worker arrested",
      "description": "Police in Region Seven (Cuyuni-Mazaruni) are investigating the murder of a 55-year-old shopkeeper, Andrew Harris called ‘Shortman’ of Surinamo Landing, Mazaruni River. Harris was reportedly killed sometime between Monday, July 31 and Tuesday, August 1, 2023, at ‘Mer Meria’ Backdam, Middle Mazaruni River. The suspect has been identified as his 34-year-old co-worker. According to Police […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/mazaruni-shopkeeper-fatally-stabbed-co-worker-arrested/",
      "image": null,
      "published": 1690992642,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Duo arrested with illegal firearm",
      "description": "Ranks from the Vigilance Police Station this morning arrested two males who were in possession of an unlicensed firearm. This was about :00h when officers from the station’s Anti-Crime Patrol responded to a report of gunshots fired at the Melanie market area on the East Coast of Demerara. While there, the officers observed two men acting […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/duo-arrested-with-illegal-firearm/",
      "image": null,
      "published": 1690992109,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Police, mines officers being deployed to Chinese Landing to suspend all mining",
      "description": "Last Updated on Wednesday, 2 August 2023, 22: by Denis Chabrol Guyanese police and officers of the Guyana Geology and Mines Commission (GGMC) are to be deployed to Chinese Landing in Region One (Barima-Waini) to suspend all gold mining to deal with concerns by the Indigenous Carib community, in response to precautionary measures that have ...",
      "source": "Demerara Waves",
      "link": "https://demerarawaves.com/2023/08/02/police-mines-officers-being-deployed-to-chinese-landing-to-suspend-all-mining/",
      "image": null,
      "published": 1691028410,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Govt asks InterCaribbean Airways to explain flight delays, cancellations; Guyana’s Honorary Consul in Antigua-Barbuda calls for compensation",
      "description": "Last Updated on Wednesday, 2 August 2023, 18: by Denis Chabrol The Turks and Caicos Islands-headquartered InterCaribbean Airways has been asked by the Guyana Civil Aviation Authority (GCAA) to explain why passengers were being inconvenienced by flight delays and cancellations, and Aviation Minister Juan Edghill on Wednesday said the carrier promised to reply this week. ...",
      "source": "Demerara Waves",
      "link": "https://demerarawaves.com/2023/08/02/govt-asks-intercaribbean-airways-to-explain-flight-delays-cancellations-guyanas-honorary-consul-in-antigua-barbuda-calls-for-compensation/",
      "image": null,
      "published": 1691013872,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "OPINION: Dr Roger Luncheon- the last of the noble men",
      "description": "Last Updated on Wednesday, 2 August 2023, 11:40 by Denis Chabrol by GHK Lall Dr. Roger Luncheon has long been gone from the public limelight, that which he occupied with some distinction in both the last and this century.  He spanned more than centuries; Roger Luncheon, on occasion, bridged the expanse that ruptures this country ...",
      "source": "Demerara Waves",
      "link": "https://demerarawaves.com/2023/08/02/opinion-dr-roger-luncheon-the-last-of-the-noble-men/",
      "image": null,
      "published": 1690990818,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "Mazaruni shopkeeper killed, co-worker arrested",
      "description": "Last Updated on Wednesday, 2 August 2023, 9:54 by Denis Chabrol A shopkeeper  has been stabbed to death at ‘Mer Meria’ Backdam, Surinamo Landing, Middle Mazaruni River, police said on Wednesday. Dead is 55-year-old Andrew Harris, called “Shortman”. Investigators said a 34-year old man, who is Harris’ co-w0rker, has been arrested in connection with the ...",
      "source": "Demerara Waves",
      "link": "https://demerarawaves.com/2023/08/02/mazaruni-shopkeeper-killed-co-worker-arrested/",
      "image": null,
      "published": 1690984497,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Region 4 sub-divisional Commander, driver injured in accident",
      "description": "Last Updated on Wednesday, 2 August 2023, 7:48 by Denis Chabrol The Police Commander of Region Four sub-division 4(b), Superintendent Mahendra Singh was injured in an accident on the East Bank Demerara Public Road on Wednesday morning, Police Commissioner Clifton Hicken said. He told Demerara Waves Online News briefly that Mr Singh sustained a “couple ...",
      "source": "Demerara Waves",
      "link": "https://demerarawaves.com/2023/08/02/region-4-sub-divisional-commander-driver-injured-in-accident/",
      "image": null,
      "published": 1690976909,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "BREAKING: Dr Roger Luncheon dies",
      "description": "Last Updated on Wednesday, 2 August 2023, 8: by Denis Chabrol Veteran People’s Progressive Party (PPP) Executive Member and former Head of the Presidential Secretariat, Dr Roger Luncheon died early Wednesday morning, his party confirmed in a brief statement. “A true son of the soil who helped to shape the lives of many, Dr. Luncheon ...",
      "source": "Demerara Waves",
      "link": "https://demerarawaves.com/2023/08/02/breaking-dr-roger-luncheon-dies/",
      "image": null,
      "published": 1690973504,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "Guyana’s oil helps ExxonM give shareholders US$8B in second quarter",
      "description": "…country is part of company’s master plan to deliver US$17B payout this year Kaieteur News – Executives at ExxonMobil Corporation were pleased to disclose that oil operations at Guyana’s Stabroek Block are helping to ensure its promise to return excess cash to shareholders is honoured. Specifically, ExxonMobil’s Chairman, Darren Woods recently noted that the oil […] The post Guyana’s oil helps ExxonM give shareholders US$8B in second quarter appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/guyanas-oil-helps-exxonm-give-shareholders-us8b-in-second-quarter/",
      "image": null,
      "published": 1691038750,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Hess boasts to shareholders about low cost of production for 5 Guyana projects",
      "description": "– sixth project plan on track for year-end  Kaieteur News – Hess Corporation, an American exploration company, has once again assured its shareholders of the multibillion dollar value of Guyana’s oil-rich Stabroek Block, revered for holding over 11 billion barrels of resources. During a recent earnings call, the company boasted to shareholders about the five development […] The post Hess boasts to shareholders about low cost of production for 5 Guyana projects appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/hess-boasts-to-shareholders-about-low-cost-of-production-for-5-guyana-projects/",
      "image": null,
      "published": 1691038692,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Exxon and partners fined US$300Kfor 75-barrel oil leak in Canada",
      "description": "Kaieteur News – An ExxonMobil-led consortium, Hibernia Management and Development Company (HMDC) has been fined US$300, for spilling 12, liters of crude-water mixture (about 75.48 barrels) into Canadian waters – which happened four years ago. According to federal agency, Canada-Newfoundland & Labrador Offshore Petroleum Board (C-NLOPB), the consortium which operates the Hibernia Platform, opted to […] The post Exxon and partners fined US$300Kfor 75-barrel oil leak in Canada appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/exxon-and-partners-fined-us300kfor-75-barrel-oil-leak-in-canada/",
      "image": null,
      "published": 1691038638,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Cops injured after sand truck crashes into police van",
      "description": "Kaieteur News – East Bank Police Commander, Mahendra Singh and one of his ranks, Constable Ellery Mason, 31 are presently hospitalised after a sand truck crashed into the police pick-up they were travelling in early Wednesday morning. Mason was driving the pick-up at the time of the accident. The crash took place around :15hrs along […] The post Cops injured after sand truck crashes into police van appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/cops-injured-after-sand-truck-crashes-into-police-van/",
      "image": null,
      "published": 1691038585,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "APNU Govt. will invest in ‘Rucatux’",
      "description": "…Norton tells Buxton Emancipation celebrations Kaieteur News – Leader of the Opposition, Aubrey Norton on Monday evening told Buxtonians that a future A Partnership for National Unity (APNU) government will invest in ‘Rucatux’, to create a musical genre of which Guyana is proud of. He was at the time ushering in Emancipation Day when he […] The post APNU Govt. will invest in ‘Rucatux’ appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/apnu-govt-will-invest-in-rucatux/",
      "image": null,
      "published": 1691038556,
      "code": "gy",
      "category": "finance"
   },
   {
      "title": "Govt. pulls plug on mining at Chinese Landing",
      "description": "…says plans for interventions continue directly with the Village Council Kaieteur News – In response to the Inter-American Commission on Human Rights’ precautionary measures issued to Guyana on July 21, 2023, the Ministry of Parliamentary Affairs and Governance announced Wednesday night that the Government of Guyana has taken a decision to stop all mining in […] The post Govt. pulls plug on mining at Chinese Landing appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/govt-pulls-plug-on-mining-at-chinese-landing/",
      "image": null,
      "published": 1691038499,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "IDB loans Guyana US$100M to repair East Bank public road",
      "description": "…two Chinese companies only bidders Kaieteur News – Two Chinese-owned companies are the only bidders vying to undertake the repair works on the East Bank of Demerara (EBD) corridor from Good Success to Timehri, a project being funded through a loan from the Inter-American Development Bank (IDB) and Guyana to the tune of US$117 million. […] The post IDB loans Guyana US$100M to repair East Bank public road appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/idb-loans-guyana-us100m-to-repair-east-bank-public-road/",
      "image": null,
      "published": 1691038427,
      "code": "gy",
      "category": "finance"
   },
   {
      "title": "$348M estimated to build 70 Core Homes in Region Four",
      "description": "Kaieteur News – The Ministry of Housing and Water – Central Housing and Planning Authority (CHPA) is gearing up to build some 70 core homes in Region Four for an estimated cost of $348,657,400. The project was recently opened at the National Procurement and Tender Administration Board (NPTAB0 office, where it was revealed that a […] The post $348M estimated to build 70 Core Homes in Region Four appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/348m-estimated-to-build-70-core-homes-in-region-four/",
      "image": null,
      "published": 1691038372,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Two men busted with illegal firearm",
      "description": "Kaieteur News – Police ranks on Wednesday arrested two men after they were found with an unlicensed firearm in their possession. At around :00hrs yesterday, ranks from the Vigilance Police Station’s Anti-Crime Patrol received information about the discharging of a firearm and immediately proceeded to Melanie (market area). According to a police release, on arrival […] The post Two men busted with illegal firearm appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/two-men-busted-with-illegal-firearm/",
      "image": null,
      "published": 1691038313,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Credit Union managers spend $31M on overseas trips as members suffer want for dividends",
      "description": "Kaieteur News – While efforts of the Guyana Public Service Cooperative Credit Union (GPSCCU) to pay dividends to its members have been at a standstill, concerns are being raised over how funds are spent on overseas trips for the current management committee. Former Chairman of the GPSCCU, Trevor Benn told Kaieteur News in an interview, […] The post Credit Union managers spend $31M on overseas trips as members suffer want for dividends appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/credit-union-managers-spend-31m-on-overseas-trips-as-members-suffer-want-for-dividends/",
      "image": null,
      "published": 1691038254,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Ghana/Guyana to host first Local Content Conference",
      "description": "Kaieteur News – A two-day Ghana-Guyana Local Content Conference is set to open on Thursday, August 10, at the Marriott Hotel. The first of its kind conference which will be rotated between the two countries is organised by the Ghana Chamber of Commerce Guyana, (GCCG) with support from the Ministry of Natural Resources and the […] The post Ghana/Guyana to host first Local Content Conference appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/ghana-guyana-to-host-first-local-content-conference/",
      "image": null,
      "published": 1691038197,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Illegal vehicles entering Guyana via borders despite GRA efforts",
      "description": "Kaieteur News – Illegal vehicles continue to enter Guyana via the borders despite the efforts of the Guyana Revenue Authority (GRA), Commissioner General, Godfrey Statia told the Public Accounts Committee (PAC) on Monday. He noted that work is ongoing to lessen the incidence of vehicle smuggling. The PAC is currently examining the Auditor General report […] The post Illegal vehicles entering Guyana via borders despite GRA efforts appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/illegal-vehicles-entering-guyana-via-borders-despite-gra-efforts/",
      "image": null,
      "published": 1691038084,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "U.S. health advisors partner with Ministry of Health to strengthen COVID-19 response and public health supply chain",
      "description": "Kaieteur News – The United States Government, through the United States Agency for International Development (USAID), is partnering with the Guyana Ministry of Health to support Guyana’s public health infrastructure. USAID’s Country Health Information Systems and Data Use (CHISU) Program, a flagship data and information system project of USAID’s Bureau for Global Health, is providing […] The post U.S. health advisors partner with Ministry of Health to strengthen COVID-19 response and public health supply chain appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/u-s-health-advisors-partner-with-ministry-of-health-to-strengthen-covid-19-response-and-public-health-supply-chain/",
      "image": null,
      "published": 1691038036,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "Pres. Ali hopeful other Chinese companies bid for oil blocks",
      "description": "Kaieteur News – President Irfaan Ali is hopeful that other Chinese companies would get involved in Guyana’s oil and gas sector by bidding for one of the oil blocks that will be up for auction. The President made those comments during an interview with Chinese state media entity CGTN. President Ali led a delegation to […] The post Pres. Ali hopeful other Chinese companies bid for oil blocks appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/pres-ali-hopeful-other-chinese-companies-bid-for-oil-blocks/",
      "image": null,
      "published": 1691037979,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Roger Luncheon passes away",
      "description": "Kaieteur News – Former Cabinet Secretary and Head of the Presidential Secretariat, Dr. Roger Forbes Luncheon passed away early Wednesday morning after a prolonged period of illness at the Georgetown Public Hospital Corporation (GPHC). He was 74. Demerarawaves reported that Dr. Luncheon had been admitted at the hospital for several weeks and had undergone surgery […] The post Roger Luncheon passes away appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/roger-luncheon-passes-away/",
      "image": null,
      "published": 1691037923,
      "code": "gy",
      "category": "science"
   },
   {
      "title": "Shopkeeper found dead, co-worker arrested",
      "description": "Kaieteur News – A shopkeeper was on Tuesday found dead at ‘Mer Meria’ Backdam, Middle Mazaruni River, Region Seven. Dead is 55-year-old Andrew Harris called ‘Shortman’. Police have arrested his co-worker for questioning. It was the co-worker who reported the man dead.  Police believe that Harris was murdered sometime between July 31 and August 1. […] The post Shopkeeper found dead, co-worker arrested appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/shopkeeper-found-dead-co-worker-arrested/",
      "image": null,
      "published": 1691037869,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Hard Truths by GHK Lall – Local Content, GRA Discontent, Guyana Lament",
      "description": "Kaieteur News – The name of the game is money, and Guyana cannot compete.  Specifically, the Guyana Revenue Authority (GRA) is reeling from the loss of quality personnel in key areas.  As the GRA Commissioner General revealed before parliament’s Public Accounts Committee, his compensation, as head chief, is put to shame by what his auditors […] The post Hard Truths by GHK Lall – Local Content, GRA Discontent, Guyana Lament appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/hard-truths-by-ghk-lall-local-content-gra-discontent-guyana-lament/",
      "image": null,
      "published": 1691037814,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Bicycle gangs creating mayhem in de city",
      "description": "Dem Boys Seh… Kaieteur News – Dem boys serious today. We gotta a messed-up situation right smack in the heart of our city. You won’t believe the audacity of these roving bicycle gangs, causing chaos, fear, and now spilling blood and murdering people. Dis happening after working hours when de city quiet and people coming […] The post Bicycle gangs creating mayhem in de city appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/bicycle-gangs-creating-mayhem-in-de-city/",
      "image": null,
      "published": 1691037755,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Minister Ramson meets Guyana Commonwealth Youth Games Team before departure",
      "description": "Kaieteur Sports – Minister of Culture, Youth and Sport, Charles Ramson Jr, yesterday morning, in his Ministry’s Conference room, delivered the charge to Guyana’s Commonwealth Youth games team before they departed Guyana for the games scheduled from 4th  – 11th August 2023 in Trinidad and Tobago. Mr Ramson remarked, “On behalf of the government and […] The post Minister Ramson meets Guyana Commonwealth Youth Games Team before departure appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/minister-ramson-meets-guyana-commonwealth-youth-games-team-before-departure/",
      "image": null,
      "published": 1691037591,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Jamaica dump Brazil and Marta out of World Cup to reach last 16",
      "description": "AFP – Jamaica ensured there would be no fairytale ending to Marta’s World Cup career as they strangled Brazil 0-0 to reach the last 16 yesterday and condemn the South Americans to their earliest exit since 1995. It was heartbreak for the legendary Brazilian attacker Marta, who at age 37 has said this sixth World […] The post Jamaica dump Brazil and Marta out of World Cup to reach last 16 appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/jamaica-dump-brazil-and-marta-out-of-world-cup-to-reach-last-16/",
      "image": null,
      "published": 1691037531,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "WI switch to T20 mode as CPL stars look to topple India",
      "description": "Big picture: IPL heroes vs CPL stars Kaieteur Sports – Though West Indies failed to qualify for the main event of the last T20 World Cup – and the upcoming ODI World Cup – their T20I side seems to be in better health than their ODI and Test teams. Either side of the T20 World […] The post WI switch to T20 mode as CPL stars look to topple India appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/wi-switch-to-t20-mode-as-cpl-stars-look-to-topple-india/",
      "image": null,
      "published": 1691037474,
      "code": "gy",
      "category": "technology"
   },
   {
      "title": "Gymkhana Post-Emancipation Horse Race meet set for this Sunday",
      "description": "Kaieteur Sports – Horse racing action returns to Nootenzuil Sideline Dam, East Coast Demerara, with the 2023 Gymkhana ‘Emancipation’ Horse Racing meet billed for 6th August. The event promises to be a heart-pounding spectacle for horseracing enthusiasts. The East Coast will come alive with thundering hooves and racing fervor, this Sunday with a stellar lineup […] The post Gymkhana Post-Emancipation Horse Race meet set for this Sunday appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/gymkhana-post-emancipation-horse-race-meet-set-for-this-sunday/",
      "image": null,
      "published": 1691037405,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Cast for Quarterfinals to be completed today",
      "description": "Digicel Schools’ National Football Championship… – Teams don new outfits for final rounds Kaieteur Sports – The final four teams for the quarterfinal stage of the Digicel Schools’ National Football Championship will be confirmed today when the Round-of-16 stage culminates at the Ministry of Education (MoE) Ground, Carifesta Avenue. In the opening match, Carmel will […] The post Cast for Quarterfinals to be completed today appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/cast-for-quarterfinals-to-be-completed-today/",
      "image": null,
      "published": 1691037350,
      "code": "gy",
      "category": "entertainment"
   },
   {
      "title": "Tropical Shipping Drag Wars 2.0 results finalised",
      "description": "Kaieteur Sports – The highly anticipated Tropical Shipping Drag Wars 2.0 had generated much hype over the past few weeks and was set to culminate in the grand finale on Sunday. Teams from Trinidad & Tobago and Suriname were here and set to take on the local competition who was ready to defend the home turf. […] The post Tropical Shipping Drag Wars 2.0 results finalised appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/tropical-shipping-drag-wars-2-0-results-finalised/",
      "image": null,
      "published": 1691037290,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "Action heads to Enmore on August 5",
      "description": "One Guyana Kares T10… – Key Super 8 matches to be played Kaieteur Sports – The final three semi-finalists will be decided as the Kares One Guyana T10 Tapeball tournament’s Super 8 stage bowls off at the Enmore Community Centre on Saturday, August 5. Six teams will be vying for a spot to be guaranteed prize winnings […] The post Action heads to Enmore on August 5 appeared first on Kaieteur News .",
      "source": "Kaieteur News",
      "link": "https://www.kaieteurnewsonline.com/2023/08/03/action-heads-to-enmore-on-august-5/",
      "image": null,
      "published": 1691037231,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Two miners die in pit collapse at Kamarang Landing",
      "description": "Police are investigating an incident which resulted in the death of Trayon Hastings, a 38-year-old miner of Kamarang Landing Upper Mazaruni and Rocky Norton (particulars unknown),  which occurred last night at around 22:30 hrs at Moonlight Backdam, Kamarang Landing. The article Two miners die in pit collapse at Kamarang Landing appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/two-miners-die-in-pit-collapse-at-kamarang-landing/",
      "image": null,
      "published": 1691070850,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Trinidad High Court blocks blogger",
      "description": "(Trinidad Express) Social media blogger Rhoda Bharath has been blocked by the High Court from making any further defamatory remarks against former police commissioner Gary Griffith related to a recent post on her “Newsauce” Facebook page. The article Trinidad High Court blocks blogger appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/regional/trinidad/trinidad-high-court-blocks-blogger/",
      "image": null,
      "published": 1691067021,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Former Trinidad Top Cop confronts golfing PM",
      "description": "(Trinidad Express) Former police commissioner Gary Griffith confronted Prime Minister Dr Keith Rowley on the Moka golf course on Saturday and told him to his face that he was a “failure” who was busy golfing four times a week when the country is in distress. The article Former Trinidad Top Cop confronts golfing PM appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/regional/trinidad/former-trinidad-top-cop-confronts-golfing-pm/",
      "image": null,
      "published": 1691066765,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Gov’t to temporarily halt  mining at Chinese Landing - -welcomes dialogue with toshao, village council",
      "description": "As part of its response to the Inter-American Commission on Human Rights (IACHR) resolution issued on July 21 concerning the Chinese Landing Village, the Government of Guyana has announced its decision to temporarily end all mining there as it engages the Toshao and council on the way forward. The article Gov’t to temporarily halt  mining at Chinese Landing appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/govt-to-temporarily-halt-mining-at-chinese-landing/",
      "image": null,
      "published": 1691043509,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Roger Luncheon passes away at 74 - -President Ali hails him as  exceptional patriot and national icon",
      "description": "Former Cabinet Secretary and Head of the Presidential Secretariat (HPS), Dr Roger Luncheon passed away during the early hours yesterday. The article Roger Luncheon passes away at 74 appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/roger-luncheon-passes-away-at-74/",
      "image": null,
      "published": 1691043457,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "North west ferry to make inaugural trip August 10",
      "description": "The new $2.5 billion (US$12.7M) north west ferry, MV MA Lisha will depart Port Georgetown on Thursday, August 10, 2023, at 4 pm for its inaugural trip to Region One. The article North west ferry to make inaugural trip August 10 appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/north-west-ferry-to-make-inaugural-trip-august-10/",
      "image": null,
      "published": 1691043324,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Bulletin issued for Friendship man over death of guard",
      "description": "The police yesterday issued a bulletin for a Friendship, East Coast Demerara man over the death of guard, Gerald Sobers. The article Bulletin issued for Friendship man over death of guard appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/bulletin-issued-for-friendship-man-over-death-of-guard/",
      "image": null,
      "published": 1691043262,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "`Use sport to expand your horizon’ - —Minister Ramson Jr., tells Guyana Commonwealth Youth Games Team",
      "description": "Minister of Culture, Youth and Sport, Charles Ramson Jr., yesterday morning delivered the charge to Guyana’s Commonwealth Youth Games team prior to their departure for the games scheduled from tomorrow to 11th August 2023 in Trinidad and Tobago. The article `Use sport to expand your horizon’ appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/use-sport-to-expand-your-horizon/",
      "image": null,
      "published": 1691043229,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Woman charged over fatal Canje Bridge accident - -placed on $200,000 bail",
      "description": "A woman was yesterday granted $200, bail after she was charged with the March Canje bridge accident which resulted in the death of Glen McLeod of Canefield, East Canje. The article Woman charged over fatal Canje Bridge accident appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/woman-charged-over-fatal-canje-bridge-accident/",
      "image": null,
      "published": 1691043200,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Schools receive kits from Petra Organisation for Digicel C/ships",
      "description": "The Petra Organization officially presented complete team kits yesterday to the schools that will be competing in the Round of 16 section of the 8th edition of the Digicel Football Championship. The article Schools receive kits from Petra Organisation for Digicel C/ships appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/schools-receive-kits-from-petra-organisation-for-digicel-c-ships/",
      "image": null,
      "published": 1691043174,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Joint Services destroy over $1.5b of  marijuana  in Upper Berbice",
      "description": "An estimated $1.5 billion worth of marijuana was destroyed during a Joint Services operation at De Veldt, Upper Berbice River. The article Joint Services destroy over $1.5b of  marijuana  in Upper Berbice appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/joint-services-destroy-over-1-5b-of-marijuana-in-upper-berbice/",
      "image": null,
      "published": 1691043151,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Police commander injured in collision with truck at Friendship",
      "description": "Two members of the Guyana Police Force, one of whom is a senior police officer, were injured following an accident on the Friendship Public Road, East Bank Demerara, yesterday morning. The article Police commander injured in collision with truck at Friendship appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/police-commander-injured-in-collision-with-truck-at-friendship/",
      "image": null,
      "published": 1691043093,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Golden Jaguars go down to Ethiopia 0-2",
      "description": "The Golden Jaguars lost to Ethiopia 0-2 in an international friendly yesterday at the Segra Field in Leesburg, Virginia, United States of America. The article Golden Jaguars go down to Ethiopia 0-2 appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/golden-jaguars-go-down-to-ethiopia-0-2/",
      "image": null,
      "published": 1691043075,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Roger Luncheon was incorruptible, dedicated and loyal to our people and to the PPP",
      "description": "Dear Editor, Very early yesterday morning news of the passing of Dr. The article Roger Luncheon was incorruptible, dedicated and loyal to our people and to the PPP appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/letters/roger-luncheon-was-incorruptible-dedicated-and-loyal-to-our-people-and-to-the-ppp/",
      "image": null,
      "published": 1691043058,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "interCaribbean not facing termination – Edghill - -despite reports of substandard service",
      "description": "Despite interCaribbean Airways’ recent woes including flight cancelations and delays, among other issues, termination of the service is not being considered by the authorities in Guyana at this time. The article interCaribbean not facing termination – Edghill appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/intercaribbean-not-facing-termination-edghill/",
      "image": null,
      "published": 1691043029,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "GMRSC issues statement on Tropical Shipping Drag Wars 2",
      "description": "A malfunction of the timing equipment was a major snag in the otherwise successful staging of Drag Wars 2.0 over the weekend at the South Dakota Circuit, a release disseminated to the media by the Guyana Motor Racing & Sports Club stated yesterday. The article GMRSC issues statement on Tropical Shipping Drag Wars 2 appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/gmrsc-issues-statement-on-tropical-shipping-drag-wars-2/",
      "image": null,
      "published": 1691043003,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Target the adult road users who are uncouth and ignorant of the rules of the road",
      "description": "Dear Editor, Hats off to the Commissioner of Police and the Traffic Officer for their multi-pronged campaign on road use. The article Target the adult road users who are uncouth and ignorant of the rules of the road appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/letters/target-the-adult-road-users-who-are-uncouth-and-ignorant-of-the-rules-of-the-road/",
      "image": null,
      "published": 1691042988,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "ExxonMobil-led consortium fined over 2019 Canadian  oil spill",
      "description": "(Canadian Broadcasting Corporation) The Canada-Newfoundland and Labrador Offshore Petroleum Board (C-NLOPB) announced yesterday that the ExxonMobil-led Hibernia will pay CDN$400, in fines as the result of a 2019 oil spill on the Hibernia platform. The article ExxonMobil-led consortium fined over 2019 Canadian  oil spill appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/exxonmobil-led-consortium-fined-over-2019-canadian-oil-spill/",
      "image": null,
      "published": 1691042971,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "St Ignatius, Santa Rosa record identical 5-2 winning scores - ——-Hat tricks for Albert, Van Sluytman in Digicel Schools football",
      "description": "St Ignatius, Santa Rosa, Tucville and Waramuri earned berths to the quarterfinals following lopsided wins yesterday in the round of 16 section in the 8th iteration of the Digicel Schools Football Championship. The article St Ignatius, Santa Rosa record identical 5-2 winning scores appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/st-ignatius-santa-rosa-record-identical-5-2-winning-scores/",
      "image": null,
      "published": 1691042957,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Limited overs success inspired Jamaica to double, says manager",
      "description": "KINGSTOWN, Jamaica, CMC – Jamaica manager, Gibbs Williams, says their conquest in the one-day version of the Rising Stars Under-19 Championship, gave them the confidence they could make a clean sweep of titles. The article Limited overs success inspired Jamaica to double, says manager appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/limited-overs-success-inspired-jamaica-to-double-says-manager/",
      "image": null,
      "published": 1691042935,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Explain ‘One Guyana’ to the nation stating how it will work in the interest of all Guyanese",
      "description": "Dear Editor, Guyana for all intents and purposes remains divided and our oil bounty is the fuel being used to widen the division. The article Explain ‘One Guyana’ to the nation stating how it will work in the interest of all Guyanese appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/letters/explain-one-guyana-to-the-nation-stating-how-it-will-work-in-the-interest-of-all-guyanese/",
      "image": null,
      "published": 1691042927,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "US deploying health experts here on supply chain management, COVID data",
      "description": "Through USAID, the United States is partnering with Guyana’s Ministry of Health on supply chain management and COVID-19 data. The article US deploying health experts here on supply chain management, COVID data appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/us-deploying-health-experts-here-on-supply-chain-management-covid-data/",
      "image": null,
      "published": 1691042898,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "An enigma though he was, Dr. Luncheon always maintained his sense of humanity",
      "description": "Dear Editor, In adversarial forms of politics, as Guyana’s is, the acrimony and disdain for, and between, opposing sides is always very palpable. The article An enigma though he was, Dr. Luncheon always maintained his sense of humanity appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/letters/an-enigma-though-he-was-dr-luncheon-always-maintained-his-sense-of-humanity/",
      "image": null,
      "published": 1691042872,
      "code": "gy",
      "category": "science"
   },
   {
      "title": "Commonwealth Youth Games delegation arrives in Trinidad",
      "description": "A podium chasing outfit of track and field athletes and swimmers arrived in Trinidad and Tobago yesterday on a quest to return with hardware from the Commonwealth Youth Games which gets underway tomorrow. The article Commonwealth Youth Games delegation arrives in Trinidad appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/commonwealth-youth-games-delegation-arrives-in-trinidad/",
      "image": null,
      "published": 1691042846,
      "code": "gy",
      "category": "entertainment"
   },
   {
      "title": "South Ruimveldt man charged with armed robbery, possession of ammo",
      "description": "Emanuel Hawker, 25, of Lot 1715 Party Place, South Ruimveldt, appeared yesterday before Chief Magistrate (ag) Sherdel Isaacs-Marcus, at the Georgetown Magistrate’s Court to answer to the charge of robbery under arms and possession of ammunition without a licence. The article South Ruimveldt man charged with armed robbery, possession of ammo appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/south-ruimveldt-man-charged-with-armed-robbery-possession-of-ammo/",
      "image": null,
      "published": 1691042836,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Colombia hope to keep party going at World Cup as last-16 beckons",
      "description": "AUCKLAND, (Reuters) – Colombia have the opportunity to finish their Women’s World Cup group campaign on a perfect note today as they look to keep the South American party going at the showpiece event for as long as possible. The article Colombia hope to keep party going at World Cup as last-16 beckons appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/colombia-hope-to-keep-party-going-at-world-cup-as-last-16-beckons/",
      "image": null,
      "published": 1691042819,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Our own people of calibre are being lured and richly paid out of our own riches",
      "description": "Dear Editor, The name of the game is money, and Guyana cannot compete, not even close. The article Our own people of calibre are being lured and richly paid out of our own riches appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/letters/our-own-people-of-calibre-are-being-lured-and-richly-paid-out-of-our-own-riches/",
      "image": null,
      "published": 1691042816,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Adventure pump station 90% complete – Mustapha",
      "description": "Minister of Agriculture, Zulfikar Mustapha last week said that works on the Adventure, Corentyne Pump Station are 90% completed. The article Adventure pump station 90% complete – Mustapha appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/adventure-pump-station-90-complete-mustapha/",
      "image": null,
      "published": 1691042770,
      "code": "gy",
      "category": "entertainment"
   },
   {
      "title": "Roger Luncheon, the early bird",
      "description": "Dear Editor, When I did some consultancy for Dr. Jagan a couple of decades back, I would arrive at OP at .. The article Roger Luncheon, the early bird appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/letters/roger-luncheon-the-early-bird/",
      "image": null,
      "published": 1691042755,
      "code": "gy",
      "category": "science"
   },
   {
      "title": "Banks DIH, Coca-Cola Caribbean launch small business training scheme",
      "description": "Banks DIH Limited in partnership with Coca-Cola Caribbean, yesterday launched the Growing Together Small Business Programme, which is geared at offering economic empowerment for micro- and medium-sized business operators especially traditional grocery businesses. The article Banks DIH, Coca-Cola Caribbean launch small business training scheme appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/banks-dih-coca-cola-caribbean-launch-small-business-training-scheme/",
      "image": null,
      "published": 1691042732,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "‘We could’ve written our own history’, says Hope",
      "description": "PORT-OF-SPAIN, Trinidad, CMC – Captain Shai Hope has rued Tuesday’s missed opportunity to end West Indies’ protracted losing slump against India and has warned his side they need to learn quicker in order to establish themselves at the highest level. The article ‘We could’ve written our own history’, says Hope appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/we-couldve-written-our-own-history-says-hope/",
      "image": null,
      "published": 1691042701,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Lacking confidence in the cybercrime unit",
      "description": "Dear Editor, On July 28, Red Thread Women (RT) issued a press statement about a threatening email sent to them the day before. The article Lacking confidence in the cybercrime unit appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/letters/lacking-confidence-in-the-cybercrime-unit/",
      "image": null,
      "published": 1691042690,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Shallow committed to governance reform",
      "description": "ST JOHN’S, Antigua, CMC – Newly elected Cricket West Indies president, Dr Kishore Shallow, said he remained “resolute” in his desire to oversee governance reform in the regional body during his tenure. The article Shallow committed to governance reform appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/shallow-committed-to-governance-reform/",
      "image": null,
      "published": 1691042655,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Tourism authority attended Global Bird Fair in UK - -several training sessions hosted",
      "description": "The Guyana Tourism Authority (GTA) hosted a series of training sessions across the country in July and also attended the Global Bird Fair in Rutland, England. The article Tourism authority attended Global Bird Fair in UK appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/tourism-authority-attended-global-bird-fair-in-uk/",
      "image": null,
      "published": 1691042653,
      "code": "gy",
      "category": "education"
   },
   {
      "title": "Cubans struggle as peso loses half its value in a year on informal market",
      "description": "HAVANA, (Reuters) – The Cuban peso was trading on the informal market at an all-time low of 230 to the dollar yesterday, slumping to half its value a year ago as consumers struggle with surging inflation and scarce goods, a widely watched tracker showed. The article Cubans struggle as peso loses half its value in a year on informal market appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/regional/cubans-struggle-as-peso-loses-half-its-value-in-a-year-on-informal-market/",
      "image": null,
      "published": 1691042639,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Jamaica through to round of 16 after frustrating Brazil",
      "description": "MELBOURNE, Australia, CMC – Jamaica’s Reggae Girls continued their history-making run at the FIFA Women’s World Cup here Wednesday, frustrating giants Brazil in a nil-all draw to become the first-ever Caribbean side to reach the second round of the showpiece. The article Jamaica through to round of 16 after frustrating Brazil appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/jamaica-through-to-round-of-16-after-frustrating-brazil/",
      "image": null,
      "published": 1691042635,
      "code": "gy",
      "category": "sport"
   },
   {
      "title": "Fitch’s downgrading of the US should result in a stronger Guyanese dollar",
      "description": "Dear Editor, The recent downgrade by Fitch of the US from AAA to AA+ should result in a stronger Guyanese dollar. The article Fitch’s downgrading of the US should result in a stronger Guyanese dollar appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/letters/fitchs-downgrading-of-the-us-should-result-in-a-stronger-guyanese-dollar/",
      "image": null,
      "published": 1691042627,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Repeat offender charged with stealing side view mirrors",
      "description": "Fifty-eight-year-old Raymond Mohamed, of Lot 317 East Street, Georgetown, appeared before Chief Magistrate (ag) Sherdel Isaacs-Marcus yesterday at the Georgetown Magistrate’s Court, to answer to the charge of simple larceny. The article Repeat offender charged with stealing side view mirrors appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/repeat-offender-charged-with-stealing-side-view-mirrors/",
      "image": null,
      "published": 1691042626,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Sunshine Girls batter T&T, Barbados lose",
      "description": "CAPE TOWN, South Africa, CMC – Dominant Jamaica crushed Caribbean neighbours Trinidad and Tobago while Barbados suffered a setback with their first defeat of the second round, on day six of the Netball World Cup. The article Sunshine Girls batter T&T, Barbados lose appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/sunshine-girls-batter-tt-barbados-lose/",
      "image": null,
      "published": 1691042578,
      "code": "gy",
      "category": "entertainment"
   },
   {
      "title": "Brazil police violence reignites after deadly Rio, Sao Paulo raids",
      "description": "RIO DE JANEIRO,  (Reuters) – Police in Rio de Janeiro killed at least nine people in a raid yesterday, in the latest example of deadly violence by Brazil’s security officials after 16 people died at the hands of Sao Paulo state police earlier this week. The article Brazil police violence reignites after deadly Rio, Sao Paulo raids appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/regional/brazil-police-violence-reignites-after-deadly-rio-sao-paulo-raids/",
      "image": null,
      "published": 1691042569,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "BVI trade delegation looking at investment opportunities",
      "description": "In light of Guyana’s rapid economic growth, the British Virgin Islands (BVI) has embarked on a trade mission, which is geared at strengthening ties between the BVI & Guyana. The article BVI trade delegation looking at investment opportunities appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/bvi-trade-delegation-looking-at-investment-opportunities/",
      "image": null,
      "published": 1691042550,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "The opposition seems held in bondage and captivity of their own making",
      "description": "Dear Editor, The opposition forces were out in full force this Emancipation with their anti-government, hate filled rhetoric, which filled volumes. The article The opposition seems held in bondage and captivity of their own making appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/letters/the-opposition-seems-held-in-bondage-and-captivity-of-their-own-making/",
      "image": null,
      "published": 1691042523,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Haiti hospital cares for kids amid gang violence, hunger and scarce aid",
      "description": "PORT-AU-PRINCE, Aug 2 (Reuters) – Marie Michelle Joseph’s 9-month-old daughter is weak and has a persistent fever. The article Haiti hospital cares for kids amid gang violence, hunger and scarce aid appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/regional/haiti-hospital-cares-for-kids-amid-gang-violence-hunger-and-scarce-aid/",
      "image": null,
      "published": 1691042517,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "England, Australia docked WTC points and fined over slow over-rate",
      "description": "(Reuters) – England and Australia have been penalised 19 and 10 World Test Championship (WTC) points, respectively and fined a percent of their match fees after they were found guilty of maintaining slow over-rate during the Ashes, the International Cricket Council (ICC) said yesterday. The article England, Australia docked WTC points and fined over slow over-rate appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/sports/england-australia-docked-wtc-points-and-fined-over-slow-over-rate/",
      "image": null,
      "published": 1691042516,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "St Rose’s career development:",
      "description": "The article St Rose’s career development: appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/photos/st-roses-career-development/",
      "image": null,
      "published": 1691042498,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Leopold St man remanded over theft of clothing",
      "description": "Twenty-nine-year-old Kevin George, of Lot 100 Leopold Street, Werk-en-Rust, Georgetown, appeared before Chief Magistrate (ag) Sherdel Isaacs-Marcus to answer to the charge of simple larceny. The article Leopold St man remanded over theft of clothing appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/news/guyana/leopold-st-man-remanded-over-theft-of-clothing/",
      "image": null,
      "published": 1691042495,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Politikles",
      "description": "The article Politikles appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/politikles/politikles-3325/",
      "image": null,
      "published": 1691042488,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Cartoon",
      "description": "The article Cartoon appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/cartoon/cartoon-887/",
      "image": null,
      "published": 1691042486,
      "code": "gy",
      "category": "science"
   },
   {
      "title": "Dengue, jobs and Dr. Luncheon",
      "description": "Dear Editor, Given the reports of deaths caused by dengue fever last month, do the authorities not see it fit to spray the coastland and clear the clogged canals? The article Dengue, jobs and Dr. Luncheon appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/letters/dengue-jobs-and-dr-luncheon/",
      "image": null,
      "published": 1691042461,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "The Charrandass Persaud saga",
      "description": "On Sunday, this newspaper reported that Charrandass Persaud, the disgraced and disgraceful former high commissioner to India was still on the payroll of the Ministry of Foreign Affairs, where “the accounts department has been instructed to keep sending his money to his account.” The article The Charrandass Persaud saga appeared first on Stabroek News .",
      "source": "Stabroek News",
      "link": "https://www.stabroeknews.com/2023/08/03/opinion/editorial/the-charrandass-persaud-saga/",
      "image": null,
      "published": 1691042460,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "3 years in Govt: Majority of manifesto promises fulfilled – President Ali",
      "description": "…says foundation being laid for Guyana 2030 President Dr Irfaan Ali has disclosed that Government’s transformative development agenda has successfully led to the realisation of a majority of its manifesto promises. “We have almost completed our manifesto… I’m most proud of all of the work that we have done,” President Ali said as he reflected […] The post 3 years in Govt: Majority of manifesto promises fulfilled – President Ali appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/3-years-in-govt-majority-of-manifesto-promises-fulfilled-president-ali/",
      "image": null,
      "published": 1691057147,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "“Product of his labour will live on forever” – Pres. Ali on passing of Dr Roger Luncheon",
      "description": "…as tributes pour in following death of stalwart Former Cabinet Secretary Dr Roger Luncheon, who headed the Presidential Secretariat under previous People’s Progressive Party/Civic (PPP/C) Governments, a party in which he was a stalwart, has died at the age of 74. Dr Luncheon, a senior Central and Executive Member of the PPP/C, served as Cabinet […] The post “Product of his labour will live on forever” – Pres. Ali on passing of Dr Roger Luncheon appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/product-of-his-labour-will-live-on-forever-pres-ali-on-passing-of-dr-roger-luncheon/",
      "image": null,
      "published": 1691057059,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "Police Commander injured in EBD collision",
      "description": "A collision between a Police car and a truck on the Friendship Public Road, East Bank Demerara on Wednesday has left Senior Police Superintendent Mahendra Singh, Commander of Regional Division 4B, injured. That accident, which occurred at approximately :15h, involved GPF motor pickup PAC 5254 and motor lorry GAE 38, belonging to Ashoka Buildcon Limited […] The post Police Commander injured in EBD collision appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/police-commander-injured-in-ebd-collision/",
      "image": null,
      "published": 1691056973,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Govts’ intervention needed to address poor interCaribbean Airways service –  Guyana Consul",
      "description": "Following numerous complaints of travellers being inconvenienced and of substandard treatment being meted out by handling agents of the interCaribbean Airways, Guyana’s Honorary Consul in Antigua and Barbuda, Robert Reis, on Wednesday called for the governments of the two countries to ensure their contractual service agreements with the airline are honoured. Over the past six […] The post Govts’ intervention needed to address poor interCaribbean Airways service –  Guyana Consul appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/govts-intervention-needed-to-address-poor-intercaribbean-airways-service-consul/",
      "image": null,
      "published": 1691056944,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "All mining operations at Chinese Landing halted – Govt",
      "description": "…says plan for interventions continue directly with Village Council The Government on Wednesday evening announced that all mining operations at Chinese Landing, Region One (Barima-Waini) have been temporarily halted. The Parliamentary Affairs and Governance Ministry has said that in response to the Inter-American Commission on Human Rights (IACHR) precautionary measures issued to Guyana on July […] The post All mining operations at Chinese Landing halted – Govt appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/all-mining-operations-at-chinese-landing-halted-govt/",
      "image": null,
      "published": 1691056890,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Looking back…  …three years later",
      "description": "It’s been three years since Granger decided to throw in the towel and not “do a Burnham”!! But rather than reflect on why they lost the elections of 2020, after winning – under the same rules and electoral lists etc – in 2015, the PNC’s insisting that the “ethnic divide” demands new electoral rules that’ll […] The post Looking back…  …three years later appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/looking-back-three-years-later/",
      "image": null,
      "published": 1691056509,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "3 years ago, yesterday",
      "description": "August 2, 2023 marks three years after the five-month political impasse of the elections of March 2, 2020, and five years, seven months after the No-Confidence Motion (NCM) of December 21, 2018. These dates are markers of the PNC’s desperate efforts to destroy the democratic edifice the PPP built after 1992 following the PNC’s rigging […] The post 3 years ago, yesterday appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/3-years-ago-yesterday/",
      "image": null,
      "published": 1691056255,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "All’s well that ends well",
      "description": "Dear Editor, August 2nd, 2023, the entire Guyana is celebrating society’s restoration from ‘autocracy’ (hypocrisy) to democracy. After the PPP/C party had convincingly won the March 5th, 2020 General and Regional Elections, the then PNC Government, led by President David Granger, had refused to hand over governance to the PPP/C Party led by Dr. Mohamed […] The post All’s well that ends well appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/alls-well-that-ends-well/",
      "image": null,
      "published": 1691054449,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "US downgrade should strengthen Guyanese dollar",
      "description": "Dear Editor, The recent Fitch downgrade of the US from AAA to AA+ should result in a stronger Guyanese dollar. Our economy is headed in the correct direction, with both leading and lagging indicators showing positives for a strong economic outlook in both the near and long terms. Having increased buying power will be a […] The post US downgrade should strengthen Guyanese dollar appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/us-downgrade-should-strengthen-guyanese-dollar/",
      "image": null,
      "published": 1691054110,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Dr Roger Luncheon’s sense of humanity",
      "description": "Dear Editor, In adversarial forms of politics, as Guyana’s is, the acrimony and disdain for, and between, opposing sides is always very palpable. One is simply not expected to admire or revere anyone from the “other side”. In the case of Dr. Roger Luncheon, however, one could not escape the obvious reality that he was […] The post Dr Roger Luncheon’s sense of humanity appeared first on Guyana Times .",
      "source": "Guyana Times",
      "link": "https://guyanatimesgy.com/dr-roger-luncheons-sense-of-humanity/",
      "image": null,
      "published": 1691053847,
      "code": "gy",
      "category": "science"
   },
   {
      "title": "“Our nation owes him a lot of gratitude” – Former President on passing of Dr. Luncheon",
      "description": "Reflecting on the life and outstanding contributions of the late Dr. Roger Luncheon, former President Donald Ramotar expressed that “our nation owes him a lot of gratitude” for all he has done for the development of the country. During a recent interview with iNews, Ramotar stated that Dr. Luncheons’ death is a great loss to […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/our-nation-owes-him-a-lot-of-gratitude-former-president-on-passing-of-dr-luncheon/",
      "image": null,
      "published": 1691093859,
      "code": "gy",
      "category": "health"
   },
   {
      "title": "Betbricks7 announced as new principal team partner for WI vs India T20I Series",
      "description": "Cricket West Indies (CWI) has announced Betbricks7 as the new principal team partner for the five-match T20I Series against India. The Betbricks7 logo is being displayed on the front of the West Indies playing jersey throughout the five-match Kuhl Stylish Fans T20I Series powered by Black and White. The series bowled off on Thursday 3 […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/betbricks7-announced-as-new-principal-team-partner-for-wi-vs-india-t20i-series/",
      "image": null,
      "published": 1691091629,
      "code": "gy",
      "category": "technology"
   },
   {
      "title": "WI win 1st T20I against India",
      "description": "West Indies secured a win by four runs in the First t20 Match against India on Thursday at the Brian Lara Cricket Stadium in Trinidad. West Indies took full opportunity with the new bail after winning the toss and elected to bat. Captain Rovman Powell scored 48 runs from 32 balls with three 6’s and […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/wi-win-1st-t20-against-india/",
      "image": null,
      "published": 1691090257,
      "code": "gy",
      "category": "technology"
   },
   {
      "title": "3 years in Govt: Majority of manifesto promises fulfilled – President Ali",
      "description": "…says foundation being laid for Guyana 2030 President Dr Irfaan Ali has disclosed that Government’s transformative development agenda has successfully led to the realisation of a majority of its manifesto promises. “We have almost completed our manifesto… I’m most proud of all of the work that we have done,” President Ali said as he reflected […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/3-years-in-govt-majority-of-manifesto-promises-fulfilled-president-ali/",
      "image": null,
      "published": 1691085157,
      "code": "gy",
      "category": "politics"
   },
   {
      "title": "Govt approaches House for $61B in supplementary funding",
      "description": "The government is seeking an additional $61. billion in funding from the National Assembly in a supplementary budget that was presented on Thursday. The funding, through Financial Paper No.3, is for continued expenditure for this 2023 fiscal year spanning several sectors. The supplementary budget was presented by Senior Minister in the Office of the President […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/govt-approaches-house-for-61b-in-supplementary-funding/",
      "image": null,
      "published": 1691080842,
      "code": "gy",
      "category": "finance"
   },
   {
      "title": "Suspect confesses to shopkeeper’s murder",
      "description": "The prime suspect in the murder of a 55-year-old shopkeeper has since confessed to the crime, according to the Guyana Police Force (GPF). The suspect has been identified as Fabian Smith, 34. “At about 15:20h yesterday [Wednesday], detectives conducted a video interview with the suspect at Bartica Police Station, during which he confessed to stabbing […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/suspect-confesses-to-shopkeepers-murder/",
      "image": null,
      "published": 1691080057,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Govt halts mining operations at Chinese Landing",
      "description": "The Government on Wednesday evening announced that all mining operations at Chinese Landing, Region One (Barima-Waini) have been temporarily halted. The Parliamentary Affairs and Governance Ministry has said that in response to the Inter-American Commission on Human Rights (IACHR) precautionary measures issued to Guyana on July 21, 2023, the Government has taken a decision to […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/govt-halts-mining-operations-at-chinese-landing/",
      "image": null,
      "published": 1691077650,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Police destroy $1.5B worth of ganja along Berbice River",
      "description": "A joint operation by ranks of the Guyana Police Force and the Guyana Defence Force (Coast Guard) has led to the discovery of 27 acres with about 406, cannabis sativa plants ranging in height from four inches to seven feet. Police said on Wednesday that, acting on information received, ranks went to De Veldt village, […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/police-destroy-1-5b-worth-of-ganja-along-berbice-river/",
      "image": null,
      "published": 1691076697,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Dredge owner, worker die after mining pit collapses",
      "description": "Two persons are now dead after the mining pit in which they were working reportedly collapsed on Wednesday evening. The incident reportedly occurred at Moonlight Backdam, Kamarang, Upper Mazaruni, Region Seven. The dead men have been identified as 38-year-old Trayon Hastings of Kamarang Landing and Rocky Norton. The dredge is owned by Hastings while Norton […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/dredge-owner-worker-die-after-mining-pit-collapses/",
      "image": null,
      "published": 1691075688,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "CANU finds $18.4M in ganja during Canje operation",
      "description": "The Customs Anti-Narcotics Unit (CANU) on Wednesday discovered a quantity of cannabis during an operation at Palmyra Village, Canje, Berbice. Based on reports received, the officers conducted a search in the vicinity of a koker at Palmyra Village, Canje during which eight parcels of cannabis were found hidden in a clump of bushes. The cannabis […]",
      "source": "INewsGY",
      "link": "https://www.inewsguyana.com/canu-finds-18-4m-in-ganja-during-canje-operation/",
      "image": null,
      "published": 1691073066,
      "code": "gy",
      "category": "business"
   },
   {
      "title": "Co-worker confesses to killing Mazaruni shopkeeper",
      "description": "Last Updated on Thursday, 3 August 2023, 10:26 by Denis Chabrol A man has confessed to killing a shopkeeper at ‘Mer Meria’ Backdam, Surinamo Landing, Middle Mazaruni River, police said Thursday. The suspect, 34-year old Fabian Smith, admitted to stabbing 55-year old Andrew “Shortman” Harris, during a video interview at the Bartica Police Station on ...",
      "source": "Demerara Waves",
      "link": "https://demerarawaves.com/2023/08/03/co-worker-confesses-to-killing-mazaruni-shopkeeper/",
      "image": null,
      "published": 1691072815,
      "code": "gy",
      "category": "crime"
   },
   {
      "title": "Miners killed after pit caves in",
      "description": "Last Updated on Thursday, 3 August 2023, 10:57 by Denis Chabrol A gold mining pit caved in late Wednesday night at Moonlight Backdam, Kamarang, killing two miners, police said. Those who perished are Trayon Hastings,38, of Kamarang Landing, Upper Mazaruni and Rocky Norton. Investigators, who visited the scene at about 1 AM Thursday, said the ...",
      "source": "Demerara Waves",
      "link": "https://demerarawaves.com/2023/08/03/miners-killed-after-pit-caves-in/",
      "image": null,
      "published": 1691072145,
      "code": "gy",
      "category": "crime"
   }
]